[
  {
    "img_url": "https://pbs.twimg.com/media/GEjRsDfWQAAPVyP.jpg",
    "index": 1,
    "text": "Another of the Israeli soldiers killed fighting Hamas terrorists in Gaza yesterday was Adam Bismut, 35.\n\nAdam founded the startup SightBit, that developed a life-saving AI system that locates drowning people at sea and alerts rescuers.\n\nMay his memory be blessed! https://t.co/lVbZrsocos"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEh6I7bXkAAjcAX.jpg",
    "index": 2,
    "text": "Baruch Dayan HaEmet\n\nThis was 33 year old Sgt. Maj. (res.) Barak Haim Ben Valid, a squad commander in the 261st Brigade's 6261st Battalion from Rishon Lezion who was killed in action in Gaza\n\nMay his memory be for a blessing https://t.co/rKuAawMWXK"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEjxFROXcAAn7nv.jpg",
    "index": 3,
    "text": "One of our 21 falling heroes yesterday was 24-year-old Sagi Idan; he and his brother fought in Gaza. His mom chose to wrap herself in the Israeli flag during his funeral. She lost one son, and the other is still fighting in Gaza. This is the outstanding spirit of our people that can never be broken. HYD ZL"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEhgW4MXMAAR01N.jpg",
    "index": 4,
    "text": "Baruch Dayan HaEmet\n\nThis was 35 year old Sgt. Maj. (res.) Adam Bismut, a squad commander in the 261st Brigade's 6261st Battalion from Karnei Shomron who was killed in action in Gaza\n\nMay his memory be for a blessing https://t.co/GaYgk9voCZ"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEhfgkyWoAEW3nL.jpg",
    "index": 5,
    "text": "24 names. 24 heroes. 24 stories.\n\nDavid, Ilay, Eyal, Matan, Hadar, Sergey, Elkana, Yoval, Yoav, Nicholas, Cydrick, Rafael, Barak, Ahmad, Nir, Elkana, Israel, Ariel, Sagi, Mark, Itamar, Adam, Shay, and Daniel \n\nWe will never forget them 💔 https://t.co/ZAP1HlUnXN"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEhgKpMXIAANWdg.jpg",
    "index": 7,
    "text": "Baruch Dayan HaEmet\n\nThis was 32 year old Sgt. Maj. (res.) Itamar Tal, of the 261st Brigade's 6261st Battalion from Mesilot who was killed in action in Gaza\n\nMay his memory be for a blessing https://t.co/url4ZHN6ol"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEjercjXoAAKH50.jpg",
    "index": 8,
    "text": "Apartheid?\n\nA Muslim prayer for the soul of Ahmed Abu Latif in front of his coffin, wrapped with the Israeli flag! 🇮🇱\n\nHe is one of the 21 IDF soldiers that lost their lives in the worst day Israel had in this war\n💔 https://t.co/7N4qXdBTy7"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEhgn_rXsAAl-rU.jpg",
    "index": 9,
    "text": "Baruch Dayan HaEmet\n\nThis was 40 year old Sgt. Maj. (res.) Shay Biton Hayun, of the 261st Brigade's 8208th Battalion from Zichron Yaakov who was killed in action in Gaza\n\nMay his memory be for a blessing https://t.co/e5VysUTQCw"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEh6_KPWwAA4D_B.jpg",
    "index": 10,
    "text": "My heart is shattered into 24 pieces. \n\nHT @michaeldickson https://t.co/KVi5LPetzQ"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEiG2x3a8AAVSgi.jpg",
    "index": 11,
    "text": "One of the fallen IDF soldiers is Ahmed Abu Latif, a Bedouin Muslim IDF soldier.\n\nAhmed embodied the spirit of unity and patriotism, a shining example of coexistence and unwavering love for Israel. \n\nAhmed, your legacy will forever inspire us. https://t.co/2tAT9foVJI"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEhizoNW0AAX0db.jpg",
    "index": 12,
    "text": "Yoval Lopez, father of 3 from Alon Shevut fell defending our land. Originally from Peru, he was part of the Bnei Moshe-known as Inca Jews-who emigrated en masse  in 1990 after converting to Judaism\n\nThe famous convert Rut said \"where you die I die\"\n\nSadly we are living her legacy https://t.co/Celvrgoj9u"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEhQQYQXoAEqmJG.jpg",
    "index": 13,
    "text": "Sgt. First Class (res.) Ahmad Abu Latif, 26, lost his life yesterday fighting in Gaza. Here's what he said in October on Facebook (shortened):\n\n\"Shalom, my name is Ahmad Au Latif, father to little Mansura, 11 months old. \n\nI am proud to be a Bedouin-Israeli!\n\nFor me, the people I live and work with are my brothers and sisters, and we all live together and respect each other in our land. I am proud to be a Bedouin that served in the IDF as a combat soldier. I was blessed to have a meaningful service that I will never forget. During my service I discovered my strength and capabilities, and how I can deal with challenges, and I met amazing people who are friends for life.\n\nI'm happy to be able to connect betweeen cultures. I can invite my friends to have meat and Maqluba in Rahat, and I can come to the garden in the Kibbutz where they play guitar and sing Hebrew songs. I am happiest when I can travel the country with my friends and when I teach them Arabic and they try to speak with me and ask for help.\n\nDuring the war we have fallen soldiers who are Bedouin, Druze, Muslims abd Christians - they died heroes protecting our country.\n\nI want to awaken everybody reading this: we all share the same fate and we must be united. Unfortunately there are people who don't believe we should be and are trying to scare and break the trust - do not let them.\""
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEgkagvXsAEw8ab.jpg",
    "index": 14,
    "text": "Baruch Dayan HaEmet\n\nThis was 32 year old Sgt. Maj. (res.) Matan Lazar, of the 261st Brigade's 6261st Battalion from Haifa who was killed in action in Gaza\n\nMay his memory be for a blessing https://t.co/yzCnDKLPIF"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEh_k24XMAIBs4R.jpg",
    "index": 15,
    "text": "These 21 young men gave their lives for their country. We are forever in their debt. https://t.co/v3Ijy2E70p"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEg40vVWcAA2qwt.jpg",
    "index": 16,
    "text": "Baruch Dayan HaEmet\n\nThis was 24 year old Sgt. First Class (res.) Israel Socol, of the 261st Brigade's 8208th Battalion from Karnei Shomron who was killed in action in Gaza\n\nMay his memory be for a blessing https://t.co/3xgFrL12HI"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEiJQLdW8AAwrsd.jpg",
    "index": 17,
    "text": "Cedric was born in the Philippines and came to Israel with his mother for work. He was a troubled kid who got caught up in crime, but when he was arrested in front of his mother in Tel Aviv as a teen, he decided he could no longer break her heart. He cleaned up his act and volunteered to serve in the IDF as a combat soldier, even earning a unit citation. Yesterday he lost his life in Gaza, protecting *our* shared country, *our* shared people. A hero. \n\nMay his memory be a blessing. 🇮🇱 🇵🇭"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEheF6kX0AEza0I.jpg",
    "index": 18,
    "text": "Elkana Vizel, one of the soldiers killed in Gaza last night, wrote a letter to his family in case of the worst. He writes:\n\nIf you are reading these words, something must have happened to me. If I was kidnapped, I demand that no deal be made for the release of any terrorist to release me. Our overwhelming victory is more important than anything, so please continue to work with all your might so that the victory is as overwhelming as possible.\n\nMaybe I fell in battle. When a soldier falls in battle it is sad, but I ask you to be happy. Don't be sad when you part with me. Touch hearts, hold each other's hands and strengthen each other. We have so much to be proud and happy about.\n\nWe are writing the most significant moments in the history of our nation and the entire world. So please, be happy, be optimistic, keep choosing life all the time. Spread love, light and optimism. Look at your loved ones in the whites of their eyes and remind them that everything we go through in this life is worth it and we have something to live for. \n\nDon't stop the power of life for a moment I was already wounded in operation Tzuk Eitan, but I do not regret that I returned to fight. This is the best decision I ever made."
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEg5L9NXkAAqUkr.jpg",
    "index": 19,
    "text": "Baruch Dayan HaEmet\n\nThis was 28 year old  Cpt. (res.) Ariel Mordechay Wollfstal, of the 205th Brigade's 9206th Battalion from Elazar who was killed in action in Gaza\n\nMay his memory be for a blessing https://t.co/MbFO6GIXrX"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEdv93uXoAErofC.jpg",
    "index": 21,
    "text": "Baruch Dayan HaEmet\n\nThis was 27 year old Maj. David Nati Alfasi, a deputy battalion commander in the Paratroopers Brigade's 202nd Battalion from Beersheba who was killed in action in Gaza.\n\nMay his memory be for a blessing https://t.co/FWj9VVW883"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEgd6BAXoAAT6d3.jpg",
    "index": 22,
    "text": "15 of the 24 faces. I don’t have any words of comfort. https://t.co/c2Q1izZqBz"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEdwAO4WoAARabw.jpg",
    "index": 23,
    "text": "Baruch Dayan HaEmet\n\nThis was 24 year old Maj. Ilay Levy, a company commander in the Paratroopers Brigade's 202nd Battalion from Tel Aviv who was killed in action in Gaza.\n\nMay his memory be for a blessing https://t.co/xMz4Dtuy5q"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEhCpXOWkAA2eo4.jpg",
    "index": 24,
    "text": "21 dead IDF soldiers? Why? Because the IDF cares about Gaza civilians so instead of bombing from the air, they sent in soldiers by foot. \n\nInstead of risking Palestinian life, Israel is risking its own children. \n\nAnd yet? The morally deprived world yells genocide. If Israel was committing anything even remotely resembling genocide, there would be zero Israeli casualties. \n\nStop believing lies and start using your brain.  \n\nOh, and by the way, several of the casualties from yesterday are Israeli Arabs. Ya know; just in case you want to throw the apartheid lie out there. \n\nThis is Achmad Abu Latif, an Arab IDF soldier who fell yesterday in Gaza. \n\nBrains, people. You have them. Use them!"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEduvzQXcAE5XBJ.jpg",
    "index": 25,
    "text": "Baruch Dayan HaEmet\n\nThis was 22 year old Cpt. Eyal Mevorach Twito, a platoon commander in the Paratroopers Brigade's 202nd Battalion from Beit Gamliel who was killed in action in Gaza.\n\nI will be attending his funeral tonight\n\nMay his memory be for a blessing https://t.co/IqXizBBiqH"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEZKBlNWsAEu6sc.jpg",
    "index": 26,
    "text": "“I wanted to marry you, not bury you”\n\nUriel Silberman was killed fighting in Gaza. At his funeral, his girlfriend Tehilla said: \n\n“I can’t promise you that I will be strong like you told me to be. If I had known that our last hug was going to be the last, I would not have let go.”"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F93Dl5pXUAAsg5I.jpg",
    "index": 27,
    "text": "The Final Image of 10 Soldiers in the 84th “Givati” Brigade of the Israel Defense Force before they entered the Gaza Strip and were Killed last night by an Anti-Tank Guided Missile Attack on their “Namer” Heavy Armored Personnel Carrier. https://t.co/CC9eoJU1xV"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-5C7XkWwAArdib.jpg",
    "index": 28,
    "text": "BREAKING:\n\nHamas releases video showing that 19-year-old Noa Marciano is dead.\n\nShe can be seen pleading for a ceasefire in an earlier video followed by pictures of her dead body.\n\nHamas claims she was killed in an airstrike, but Israelis say it looks like she has been tortured https://t.co/sID01GQ8bj"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_DLI6jW4AAq49p.jpg",
    "index": 29,
    "text": "Captain Shlomo Ben Nun, 22 \nCaptain Asaf Master, 22\n\nTwo more fallen heroes, who died fighting to defend us from the monsters of the October 7 Massacre 💔 https://t.co/k5yfIonl6t"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_QlRN3XMAA-7OW.jpg",
    "index": 30,
    "text": "Shahar Friedman saying goodbye to his parents before the ground invasion of the Gaza Strip.\n\nHe was just killed in battle against Hamas.\n\nBefore being called up to serve, he worked with kids with special needs.\n\nRest in Peace Shahar https://t.co/Seq5I6iG5l"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_amYaSWIAAPYSO.jpg",
    "index": 31,
    "text": "Unimaginable loss 💔\n\nVered Benvanisti’s father fell in the Yom Kippur war with Syria and Egypt. \n\nHer brother, Arnon, fell in the 1982 war with Lebanon.\n\nHer son Arnon - named after her brother - has fallen in the 2023 war against Hamas.\n\nMay his memory forever be a blessing 🕯️ https://t.co/Lsso0u5eJP"
  }
]