[
  {
    "img_url": "https://pbs.twimg.com/media/GEoIw7OW4AEKfs6.jpg",
    "index": 0,
    "text": "One page of a fifth-grade textbook in Iran:\n\n“Israel must be destroyed”\n-Khomeini\n\nThis is just one example, which applies to our entire educational system in Iran. https://t.co/Wj1lcMPQnQ https://t.co/fK0Nt8ctKK"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Qj_X-WcAA93O3.jpg",
    "index": 1,
    "text": "In 2018, the Mayor of Hebron, a Palestinian city in the West Bank with a population of 220,000 offered Palestinians $5 for killing dogs. \n\nThe mayor told Palestinians to kill as many dogs as possible and offered a $25 reward for killing 5 dogs. \n\nThousands of dogs were then shot and killed by Palestinians in The West Bank. \n\nImages of dogs being tortured, killed and abused by Palestinians began spreading on social media at the time. \n\nAnother Palestinian mayor, the Mayor of Tulkarm then followed suit and offered rewards for Palestinians to kill stray dogs. \n\nThe mayor who announced the initiative Tayseer Abu Sneineh, had previously been convicted for his involvement in the 1980 Hebron terrorist attack which killed 6 Jewish people- 3 Israelis, 2 Americans & 1 Canadian. \n\nSources:\n\nhttps://t.co/BB5nI6LGHF\n\nhttps://t.co/Oix7EK6woq"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Qs3HGWYAER-n3.jpg",
    "index": 2,
    "text": "This was one of the dogs rescued from\nHebron, West Bank in 2022 after the Mayor of Hebron offered a $5 reward for Palestinians to kill stray dogs. \n\nThousands of dogs were tortured and killed. \n\nIsraelis were able to rescue this dog and treat his ailments at a dog shelter in Israel. \n\nSource: @YosephHaddad"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-Ov8uVXEAANmSu.jpg",
    "index": 2,
    "text": "#Hitler had 12 years to indoctrinate kids to Naziism in #Germany's schools. \n\nYet, only 9 months into Hitler's rise to power, lifelong writer, editor & publisher Alexander Brin wrote (in Oct 1933) that #antisemitism was so deeply ingrained in classrooms that even if Hitler were \"overthrown tomorrow,\" it would take generations to repair \"the damage that has been done by the poison instilled into the minds of the children.\"\n\nIt did, in fact, take generations of denazification & Germans coming to terms with the true nature of the evil done during the Holocaust for their society to turn things around. \n\nNow I ask: what sort of dehamasification will be needed in #Gaza after its 17 years of rule over the education system that brainwashed young #Palestinians to their extremist & genocidal worldview?\n\n#FreeGazaFromHamas #JewHatred #IraniansStandWithIsrael #HamasisISIS #HamasisISIS #HamasISIS #Hamas_is_ISIS"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-lsFV3W4AActEu.jpg",
    "index": 16,
    "text": "13-year-old Hallel Yaffa Ariel, 13, was stabbed to death while sleeping her bed.\n\nThe Palestinian Authority leader Mahmoud Abbas’ party posted the terrorist’s picture on its official Facebook page, declaring him a martyr/hero (Shahid)\n\n(2/2) https://t.co/BHgs4rQykO"
  },
  {
    "img_url": "https://pbs.twimg.com/card_img/1754102009085546496/fANVZfe8?format=jpg&name=small",
    "index": 17,
    "text": "Meanwhile in Gaza’s Beit Hanoun: IDF finds dozens of guns, bombs inside a kindergarten\n\nעשרות כלי נשק ומטענים בגן הילדים: צפו בחשיפה של צה\"ל ברצועת עזה https://t.co/Vj3UALmFB6"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-57_DzXUAAJ2BL.png",
    "index": 22,
    "text": "🔴 Claire Stringer is a first-grade teacher at a charter school in LA. Stringer taught her students “a lesson on the genocide in Palestine” which blamed Israel for Hamas’ war crimes &amp; promoted the expulsion of Jews from Israel.  https://t.co/mtu9MuY0iv https://t.co/oRIv2PPQ7a https://t.co/SkhfBF70Qy"
  },
  {
    "img_url": "https://pbs.twimg.com/card_img/1754820178259345408/xtc7hyGO?format=jpg&name=small",
    "index": 23,
    "text": "\"We're going to a massacre. Bring the kids.\"\n\nChildren as Young as 10 Took Part in Hamas's Oct. 7 Terror Attack, Survivors Say\n\nhttps://t.co/El1XEA8EP4"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_N4206XwAAQsSL.jpg",
    "index": 28,
    "text": "UNRWA in Gaza has 30,000 employees. Except a few foreign UN members, the rest are Hamas members from Gaza. It’s well documented. They can’t hire anyone else to work there so they let Hamas run UNRWA for years. Anything from UNRWA is basically Hamas driven info. \n\nThis is an UNRWA Gaza school play. A picture is worth a 1,000 words…"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ThoDFWkAA07FP.jpg",
    "index": 29,
    "text": "#Hamas distributed video of attacks against\nIDF tanks includes a Palestinian child handing an RPG to a Hamas terrorist. Recruiting #ChildSoldiers is a war crime. Waiting for condemnation by @UN  @UNICEF @UNICEFpalestine https://t.co/xahSjGiZUy"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_izVcpWcAAJVJs.jpg",
    "index": 31,
    "text": "Watch: Maryam Mohammad-Farhat was the most popular female Hamas politician in Gaza after she sent her 3 sons to be suicide bombers and kill Jews. In this video she admits that she is the one who encouraged her children to kill Jews and die. When the reporter asked her why she wanted her children to die while killing Jews, she explained that it is part of Jihad and Islam. At the end of the interview she sent a message to all Jews in Israel, urging them to hand over all of  Israel's lands to the Palestinians and flee before they will be blown up into pieces by Palestinian suicide bombers.\n\nThis video proves that Hamas is the obstacle to peace in the Middle East. Hamas terrorists do not want a two-state solution and they are even ready to sacrifice their own children for the sake of Jihad against Jews.\n\nLink to the video: https://t.co/Kzw48rzSGf"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_0M-b4XwAETG5W.jpg",
    "index": 34,
    "text": "15-y-old Ammar Abu Al-Wafa was shot to death in Jenin by Israeli security forces tonight.\n\nThe international press will show the world his picture that is on the left\n\nThey will ignore his picture on the right &amp; will also not write anything about him shooting at IDF with an AK47 https://t.co/NXc39IreMj"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEhPeFEWsAArDiz.jpg",
    "index": 3,
    "text": "“There are girls there who have not had their period for a long time…” \n\nFormer hostage Chen Goldstein Almog, 48, explained that the women in Hamas captivity are still being raped often and feel they have been abandoned. \n\n“They feel that they have been forgotten, that they were abandoned on October 7 and they are still abandoned.”\n\nThere are 13 women and girls still in Hamas’ clutches. \n\nThey have not been abandoned. \n\nThey have not been forgotten.\n\nWe will fight tooth and nail until every single one of them is home. \n\nBring them all home NOW!"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-M3Xg2W4AA9lol.jpg",
    "index": 8,
    "text": "#Hamas killed Gazans, and when the world ignored that, they killed Israelis. The pictures here show what life was like under Hamas terrorists in #Gaza. Every Gazan who opposes Hamas is called an Israeli spy and is killed. Do you want this for Gazans, Hamas sympathizers? Do you still believe what Hamas says about any story? And why didn't NGOs, human rights organizations, London, and Paris protest against this? \n#HamasTerrorists #Israel \n*pic's Reuters on November 20, 2012."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-bAVXcaYAAr7WI.jpg",
    "index": 11,
    "text": "In an interview with Lebanese journalist Marlene Khalifeh, senior Hamas official Osama Hamdan said that if they could turn back time, they would still carry out the October 7 attacks and that their goal is end Israel’s ambitions to be a “natural entity” in the region. https://t.co/P3kSfI38eo"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-rIWexaQAAXJ6W.jpg",
    "index": 13,
    "text": "This is an absolutely must-watch interview with Syrian-born Palestinian social activist Manar Al-Sharif.   \n\nShe went to Gaza to try to help the civilians there get necessities and education to better themselves and  had her eyes opened to the brutal and impoverished reality of Hamas in Gaza for the Palestinian people  \n\nI watched almost all of it before I went to bed. I I’m now on the part  where Hamas threw her in prison for refusing to stop speaking up about Hamas’ mistreatment and theft of aid from the Gazan civilians they have left impoverished by stealing billions meant to better the lives of Palestinian families.  \n\nNot  a short interview but worth listening to in a way a few interviews are.  Amazing stuff. Palestinian woman telling it like it is, and damn, it’s ugly.  \n\nThis shows why @IDF is doing a huge service to the poor Palestinian people brutalized and murdered and left with nothing by Hamas.  \n\nAn amazing part of this is where she mentions that the people told her life was better when the Israelis actually “occupied” Gaza. \n\nThe people had work and pretty good lives and didn’t encounter the horrible brutality of Hamas. Those who remember these days really resent Hamas, she explains.  \n\nWow.\n\nInterview here with English translation embedded: https://t.co/ThzOk0EN4m"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-zuYXNWkAECqwC.jpg",
    "index": 15,
    "text": "In 2015, Amnesty reported that Hamas was using al-Shifa Hospital as their base to interrogate, torture and murder Palestinians.\n\nSee for yourselves: https://t.co/SxSEmPLFnp https://t.co/9ExrqZTCSq"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_YOYRpXkAAoqY6.jpg",
    "index": 19,
    "text": "This is where Hamas metes out fake \"justice\" (ie persecution) for non-crimes such as \"normalisation \".\n\nIn other words, having conversations with Israelis.\n\nhttps://t.co/oNoGZmRZ6O https://t.co/1m6dv2ojxz"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_o5wIiXMAAb1-1.jpg",
    "index": 21,
    "text": "Have all the anti-Israel protesters who are outraged by Israel's defense measures ever wondered what would happen to the Jews if Israel removed all the checkpoints, fences and walls? As you can see in this video (link below) senior Hamas leader Fathi Hammad demonstrates how Jews will be treated in \"Free Palestine\".\n\nIn 2005 Gaza was \"free\" after Israel expelled all the Jews and gave the territories to the Palestinian Authority. Sadly, in 2006 the Palestinians in Gaza voted Hamas into power, even though its charter explicitly calls for the genocide of Jews. Israel was forced to defend itself after Hamas began terrorizing Israeli civilians in the south. We didn't build a wall and security fences \"just for fun\". \n\nThis video and the terrorist attack on October 7th make the intentions of Hamas very clear. Hamas terrorists don't want a state alongside the State of Israel. They want a state instead of the State of Israel.\nHamas terrorists do not want \"coexistence\" with the Jews as they publicly and explicitly call for genocide and ethnic cleansing of Jews.\n\nLink to the video: https://t.co/bLM4ekVJ3E\n\nPlease retweet if you support Israel's right to exist and defend itself!"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_-JsbpXoAAtjT8.jpg",
    "index": 23,
    "text": "Watching the release of the hostages is the most surreal thing I’ve ever seen in my life. \n\nInfants escorted by masked armed terrorists and handed to the Red Cross. \n\nNone of this makes any sense. \n\nAs I keep saying, if I look at these events with a human lens, I’ll lose my mind. It’s all so insane, on so many levels. \n\nIt’s so hard to believe any of this is really happening."
  },
  {
    "img_url": "https://pbs.twimg.com/card_img/1755708750613118976/eG9-uYQN?format=jpg&name=small",
    "index": 1,
    "text": "A 28-year-old evacuee from Gaza City now residing in Khan Younis saw his brother murdered by Hamas. Both had been involved in peaceful demonstrations against Hamas...\n\nThe voices of Palestinians living under Hamas:\n\nhttps://t.co/fbzQXX9Wty"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-DaYvpWEAANxQ7.jpg",
    "index": 2,
    "text": "Senior U.S. Officials have stated that Hamas attempted to use Ambulances provided by the Red Cross and Red Crescent to Escape from Gaza to Egypt earlier this week alongside 76 Palestinians who had been Seriously Wounded and required Higher-Medical Care in Egypt; the Plot was Discovered  by the United States and Egypt when they they were provided a List by Palestinian Authorities of Patients who needed to be Transferred out of the Gaza Strip to Egypt, but after Vetting it was realized that over a “Third” of the Names were of known Hamas Terrorists so that List was Rejected and only 76 were Accepted."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-XSymBXkAAFfSi.jpg",
    "index": 3,
    "text": "Hamas rockets have now hit Israel’s Barzilai hospital in Ashkelon 3 times in the last month. \n\nHow much coverage have you seen about it? https://t.co/MFH8SqFjQW"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-WiIFIXUAAQXyM.jpg",
    "index": 4,
    "text": "The Israel Defense Force has Discovered another Hamas Rocket Launch Sites with a Large Stockpile of Munitions inside of a School/Youth Center in Northern Gaza; the Munitions and Launchers have since been Destroyed by Explosive-Ordnance Disposal Teams. https://t.co/AR5TCqQuFq"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-T7IaGXIAARaZt.png",
    "index": 5,
    "text": "Israeli forces captured a Hamas/PIJ 49 tube multiple rocket launcher (possibly for 122mm caliber artillery rockets) set up at a youth movement building in the Gaza Strip. https://t.co/JqVR33vO1V"
  },
  {
    "img_url": "https://pbs.twimg.com/card_img/1752172165682659328/2QzWKGGK?format=jpg&name=small",
    "index": 7,
    "text": "For those of you who require proof (in good faith), please watch/read in the link.\n\nFor those of you for whom no proof will ever be accepted against your hateful narrative - f^*k off!\n\nWATCH: #Hamas uses ambulances to transport #terrorists, weapons - #IDF https://t.co/N0sjswJ34n"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-gWCQkacAAtxn3.jpg",
    "index": 9,
    "text": "A school in the southern Israeli city of Eilat was bombed earlier today. \n\nThese are war crimes you won’t hear about. Now why is that? https://t.co/tv2hHlYxAi"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-k21thXoAE0EEm.jpg",
    "index": 11,
    "text": "BREAKING: 2 Israeli women injured by Hamas rockets in Tel Aviv. One of them is 40 year-old nurse. They’ve been taken to Ichilov hospital,\n\nEvery single one of Hamas rockets is a war crime. They indiscriminately target civilians, and medical team. \n\nNot a word from: @MSF_USA @WHO https://t.co/wGmTe0CmyY"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-1uK0KW0AAkJ1D.jpg",
    "index": 14,
    "text": "A U.S. Intelligence Official has now stated that the Evidence provided by Israel which claims a Hamas Command and Operations Center is beneath Al-Shifa Medical Center in Gaza City is True, further stating that the Fuel provided to the Hospital is often Stolen by Hamas Fighters who Regular Stage and Gather around the Hospital in order to use the Facility and its Patients as “Human Shields.”"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEoaVdRXkAAB1t-.jpg",
    "index": 0,
    "text": "3/\n\nSubject: \nGranting Release\n\n With regard to the matter mentioned above, we ask of you to release the brother Hani Saeed Saleem Salah, who works at the education administration in west Khan Yunis, as we need him for military training on the 28/09/2023. This date is not flexible."
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEjHzdJWEAAGqvO.jpg",
    "index": 2,
    "text": "This is a sensitive topic, and I don't underestimate the lives lost in this war. \n\nBut, despite international media claims of Israel targeting journalists in Gaza, the facts are that Israel doesn't target journalists to silence them.\n\nIDF didn't disproportionately kill non-terrorist journalists.\n\nAccording to @mishtal research, 85 of the \"journalists\" killed in Gaza were active terrorists affiliated with Hamas or other terror organizations in Gaza. Another 5 \"journalists\" were killed while being close to other terrorists who were eliminated.\n\nFor example, the \"journalist\" Maztapa Taria who was killed alongside the \"journalist\" Hamza al-Dahdo, who according to documents found by the IDF in Gaza, both belonged to the terrorist organizations in Gaza. \n\nor the journalists Muhammad Mater, Anas Abu Shamla and Montaser al-Sawaf - all belong to the terrorist organization Hamas. All these are just examples of \"journalists\" killed in Gaza.\n\nOnly 19% of the killed journalists were not proven to be terrorists, and the circumstances of their deaths were not precisely determined. In any war, circumstances may become clear in the future, and sometimes journalists die in tragic circumstances\n\nWhile in  Israel has press freedom and liberal democracy, allowing any journalist visiting Israel to speak freely, And every journalist who has been in Israel will testify to that. in Gaza, controlled by the fundamentalist Islamic terror organization Hamas, has no press freedom at all.\n\nEvery war is terrible, and the current conflict in Gaza is especially dire. As part of their military strategy, Hamas uses civilians as human shields, both in combat and as shields for their terror infrastructure and rocket launchers.\n\nAs a result, despite the IDF's immense efforts, civilians continuously suffer. Reports from Gaza on casualty numbers, IDF airstrikes, and fighting between IDF soldiers and Hamas are constantly quoted by international media, but verifying these claims is challenging, and many have been proven entirely false.\n\nIn Gaza, there are no journalists who can expose the truth about these numbers and reports. True journalists working in Gaza cannot reveal that, for example, in an airstrike, civilians were not killed, only Hamas militants were.\n\nIf a Gaza journalist dares to tell the truth about the number of terrorists killed, Hamas will kill them immediately them.\nNone of the real journalists in Gaza can tell the truth.\n\nThe truth is one of the casualties of war, so it's crucial to expose the journey of lies and manipulation by the terror organization Hamas.\n\nVery few journalists in Gaza are genuine journalists, and even they can't tell the truth due to the dictatorial and terrorist rule in Gaza. The rest of the \"journalists\" in Gaza are not journalists but terrorists collaborating with Hamas.\n\nIt's time to understand that most journalists in Gaza are #TerroristsNotJournalists. And those who are real  journalists do not tell the truth.\n\nA \"press\" vest, anyone can buy at \"Ali Express\", but not everyone who wears a press vest is a journalist.\n#HamasislSIS #TerroristsNotJournalists"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEiu-J_XoAU5ute.jpg",
    "index": 3,
    "text": "A new poll shows that the vast majority of Palestinians (90%) think that the October 7th massacre was “a legitimate resistance operation”.\n\nTell me more about “innocent Palestinian civilians”… Tell me more about “a few bad apples”… 90% of them are “bad apples”!\n_ https://t.co/q5DinPcbp9"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9q3GC6XUAAEbrq.jpg",
    "index": 8,
    "text": "This guy was the subject of a glowing @nytimes profile and speaker at @Penn's \"Palestine Writes\" festival last month. Now tell me you don't know why antisemitism is rising in America. https://t.co/ZCRgmn2Oe2"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9uGmAVXQAAyUjC.jpg",
    "index": 9,
    "text": "Ahed Tamimi, the “Palestinian peace activist” posted on her Instagram:\n“Come on settlers, we will slaughter you. We are waiting for you in all the cities of the West Bank. What Hitler did to you was a nothing. We will drink your blood and eat your skulls. We are waiting for you.” https://t.co/73CqOiQg3q"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-fgRodXoAADoOf.jpg",
    "index": 13,
    "text": "Innocent Palestinian civilians elected Hamas.\nInnocent Palestinian civilians supported Hamas.\nInnocent Palestinian civilians joined the massacre, committing most of the sadistic crimes.\nInnocent Palestinian civilians celebrated the massacre.\n\n“Innocent Palestinian civilians”? 🧐 https://t.co/xHNS6tgHcn"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_FiFViXUAAfvFz.jpg",
    "index": 18,
    "text": "This is an opinion poll on the ground in Palestine today.\n\nAs you can see, my views are not mainstream today. 74.7% of Palestinians want all the land, river to sea.\n\nBut that is not a realistic solution. We need realistic solutions, &amp; I will promote them.\n\nhttps://t.co/TbRNr5rfgT https://t.co/oXVCozjkzP"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Fd7S1XEAAWgIh.jpg",
    "index": 19,
    "text": "New poll: 75% of Palestinians support the massacre of Jews on October 7.\n\nIn the West Bank, 83.1% support slaughtering Jews, while only 6.9% oppose. \n\nKnowing this, what sane person would support a Palestinian state?"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Iu0EdWsAETIZz.jpg",
    "index": 21,
    "text": "It is important to not mix up Hamas and ordinary Palestinians.\n\nNot all Palestinians support the raping and torturing and kidnapping and killing of innocent Israelis.\n\n5.4% of Palestinians somewhat do not support that and 7.3% of Palestinians are extremely against it! https://t.co/9zJtw5AOPO"
  },
  {
    "img_url": "https://pbs.twimg.com/card_img/1755932946903474176/qgI8SFoh?format=jpg&name=small",
    "index": 22,
    "text": "You can read the full story by @reglash in @J_Insider"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_jc9oGXoAAllqu.jpg",
    "index": 26,
    "text": "⚠️ Content Warning: This Gazan citizen in the photo proudly recorded himself live in the October 7 massacre, first he injured a foreign worker, then stepped on his dying face, then took a hoe and started beating the man with it until he killed him. When he finished he shouted that he was a hero and thanked God, threw the hoe and went to murder more innocents.  This man is probably now in Gaza shouting to the world that he is poor man. I hope the NILI unit gets to him and then he really will be.\n#October7massacre\n#TheWestlsNext\n#terrorists"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_GevyOXYAAax1L.jpg",
    "index": 0,
    "text": "This is the first poll I’ve seen of Palestinians (Gaza &amp; WB) since 10/7. \n\n75% support the 10/7 massacre. \n\n76% have a positive view of Hamas.\n\n98.2% have a negative view of America \n\nInterestingly, 64% have a negative view of Iran. \n\nhttps://t.co/rmMrMzVIiI https://t.co/8pBaTL3XTX"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Gui-oWkAA53t0.jpg",
    "index": 1,
    "text": "75% of Palestinians in Gaza and the West Bank support Hamas and the October 7 atrocities.\n\nPalestinian civilians overwhelmingly support Hamas’ attacks on Israel that killed over 1,400, including children and babies, and which resulted in 240 hostages taken, including children and babies— which then led to Israel entering Gaza.\n\nThis poll was conducted by an Arabic company 4 weeks after the attacks."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_QEAJ1XIAA-42A.jpg",
    "index": 3,
    "text": "From 2019…\n\nNot much has changed… https://t.co/IlC4ueamVE"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_VxO8UXgAEva8u.jpg",
    "index": 6,
    "text": "There is no easy answer for what to do with a post-Hamas Gaza. The Palestinian authority, in addition to also excusing terrorism, is incredibly corrupt. \n\nThe recent poll of Palestinians has them with a 10.3% positive rating. \n\nDon’t see how that’s going to be a good answer. https://t.co/1PoWEVDILB https://t.co/OtcyPfgVdD"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_vKpMDWoAAgBlr.jpg",
    "index": 8,
    "text": "Hundreds of Palestinian CIVILIANS lined the streets tonight to cheer and whistle as 2 Palestinian men were executed and hung upside down on a metal pole. \n\nOne of the executed men then had his legs cut off with his body discarded and thrown into a pile of rubbish. \n\nHamas claimed the 2 victims were Israeli informants. \n\n The victims are: \n\nHamza Ahmed Hamza Mubarak - 31 years old - resident of Tulkarm camp - Alballuna neighborhood. \n\nAzzam Jamal Hafez Javabra - 29 years old - resident of Kfar Rai, Jenin. \n\nSource: Telegram"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_s-MG8WMAAo0Ua.jpg",
    "index": 1,
    "text": "Palestinians 🇵🇸 have received more aid money than any other country in history.\n\nWhere did the money go?\n💰 Yasser Arafat: $3B\n💰 Mahmoud Abbas: $2B\n💰 Khaled Mashal: $5B\n💰 Ismail Haniyeh: $4B\n💰 Mousa Abu Marzouk: $3B\n💰 Cost of Hamas terror tunnels: $10B\n\nMoney well spent...\n_ https://t.co/bl6Rc4Gn2B"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_8-WelWoAEGA8H.jpg",
    "index": 3,
    "text": "Every peace treaty in history has been based on compromise. Justice is essential, but the pursuit of absolute justice can lead you to perpetuating conflict indefinitely, never reaching peace. If you need to choose between justice and peace – choose peace.\n\nMore on this idea here>> https://t.co/lJ5cJbxwA2\n\n#quote #peace #justice #choice"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9ysHN6XoAAtbNs.jpg",
    "index": 0,
    "text": "Glad to update that #MrFAFO is alive and well, and now he is a radiologist 🤣 https://t.co/e0XxCEzn6y"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F92_A7YXsAAgzmu.png",
    "index": 3,
    "text": "The adventures of Mr. Pallywood. This fella pops up regularly in Palestinian propaganda videos. \n\nSo far, he has died twice, returned to life as a radiologist, fathered a child, and most recently, turned into a foreign correspondent. https://t.co/MOxQOe5SNw"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-AWVR9W4AAaTEr.jpg",
    "index": 4,
    "text": "Do children in Gaza have 6 fingers?\n\nOr are they using the free version of AI again? 🤣\n_ https://t.co/JcHKdSYZ6y"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-B8oESWUAAc8CI.jpg",
    "index": 6,
    "text": "Tonight’s BBC 6pm news began coverage of Gaza news with a @BowenBBC report featuring the latest appearance of Hamas actor Saleh al-Jafarawi in what is obviously a piece of Hamas staged footage. @BBCNews amazingly seems not to be aware of who he is or that it’s being played. https://t.co/M7jbbTnd6M"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-fCkdAX0AAfMHv.jpg",
    "index": 9,
    "text": "Interesting. https://t.co/3xeQtLYsJH"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-my3Q5XIAAvfyL.jpg",
    "index": 12,
    "text": "The IDF confirmed that the blast at Shifa hospital in Gaza City earlier today was caused by an errant missile launched by Palestinian terrorists.\n\nNaturally Hamas blamed Israel and people listened to the terrorist group. Because that's what folks do in 2023. https://t.co/fzHsijtn7S"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_FexDdWIAA0Reb.jpg",
    "index": 20,
    "text": "These headlines were published more than ONE MONTH apart. How has Gaza had a communications network till now if fuel was expected to run out by 16 October, as the @BBC and everyone else reported based on nothing more than Hamas said so? https://t.co/2gtUgA0kWd"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEmf9IOW8AA5Gr_.jpg",
    "index": 0,
    "text": "Auschwitz survivor Primo Levi famously wrote:\n\n“Monsters exist, but they are too few in number to be truly dangerous. More dangerous are the common men, the functionaries ready to believe and to act without asking questions.”\n\nHow relevant are Levi’s words today, as so many, so-called ‘enlightened’ voices in the West, continue to remain silent or worse yet, seek to minimize, justify or deflect from the monstrous evil perpetrated by Hamas!"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEYIeUgXcAAnJ7V.png",
    "index": 2,
    "text": "Fatemeh Shams, a prof @Penn, spoke at two pro-Hamas rallies on campus. At one, which was held just days after the Hamas massacre of 1,200 Israelis, she claimed, \"as long as the fascist Netanyahu regime exists, Hamas has a right to exist.\" https://t.co/o1qy7SQOBs https://t.co/UYPJrawtfj"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9tOd9rW4AAc9LT.jpg",
    "index": 9,
    "text": "BREAKING: @ucl_ucu academics voted for “Intifada until victory” and a “mass uprising” against Israeli civilians. This is a horrific incitement to violence and terror.\n\nWe have written to UCL’s Provost to express disgust at the  motion &amp; call for urgent action in the wake of this. https://t.co/WRDQK17k2t"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9y7pjoacAAbn35.jpg",
    "index": 12,
    "text": "Poll shows 80% of Lebanese support the October 7th attacks. Includes\n\n98% of Shia\n86% of Druze and Sunni\n60% of Christians\n\nIf this isn’t believable to you, you probably haven’t talked politics with many Arabs. https://t.co/8u3I4AHmYx https://t.co/bDr0dNC4de"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-DDaMRXgAAme_Z.jpg",
    "index": 18,
    "text": "In #London, the Foreign Office building was spray-painted and vandalized\n\nIn social networks write that the \"action\" is dedicated to the 106th anniversary of the Balfour Declaration. \n\nℹ️ The Balfour Declaration was a public statement issued by the British government announcing its support for the establishment of a \"national home for the Jewish people\" in Palestine then an Ottoman region with a small minority Jewish population. The declaration was contained in a letter dated 2 November 1917."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-Is38VXwAAXXWu.jpg",
    "index": 22,
    "text": "No one who seeks peace calls for an uprising (intifada). The Free Palestine protests does not call for peace and humanitarianism but for more violence, war, destruction of Israel. Vandalism (pic from Washington DC) is just a preview. https://t.co/hWKySfoigz"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-K7N8HWcAAEZ0S.jpg",
    "index": 24,
    "text": "At a @NorthwesternU Students for Justice in Palestine rally in downtown Evanston yesterday, a masked protester carried a Hamas flag. The university had previously described this demonstration as being held to “raise awareness about the violence in the Middle East.” https://t.co/Ve48TyM6y0"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-SlsA-WIAAZE2S.jpg",
    "index": 28,
    "text": "BREAKING:\n\nIncoming reports of an anti-Israel protester having killed an Israel supporter named “Paul” in Los Angeles just moments ago. https://t.co/KI1Q7b416q"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-aKEuaaQAAEyEM.jpg",
    "index": 33,
    "text": "Take #4262 of Hamas spokesmen making my job easy by explaining the mortal threat Hamas poses to Israel’s people—and why we must eliminate it. \n\nvia @nytimes https://t.co/rVhRoOmkSk"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-g4-sBbkAATpbJ.jpg",
    "index": 38,
    "text": "George Washington University - student holds a “glory to our martyrs” sign.\n\nApplauding those that murdered 1400 Israelis on October 7th is horrifying and must never be accepted as the norm in the U.S.\n\nRecognize him? DM us. https://t.co/BkOcsDD35C"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-rk06IWYAAr34o.jpg",
    "index": 55,
    "text": "Stop The War stewards blocked my way at the start of Palestine march today\n\nThey objected to my placard?\n\nSaid I was \"a troublemaker\". \"We are here to stop you,\" they said. \"We know what you did at the Ukraine march.\" I supported arming Ukraine\n@J_Bloodworth @Ozkaterji @im_PULSE https://t.co/cjdtPEBonB"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-xQI31WcAAziV3.jpg",
    "index": 56,
    "text": "Pigeon Coffee appeared on a list of Jewish-owned businesses to boycott. Today, their coffee truck was smashed in Montreal. Because that'll #FreePalestine https://t.co/GMSRqOtAXc"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-0w-QBW4AAQHPM.png",
    "index": 63,
    "text": "🔴 Efe Ercelik is accused of punching a Jewish student in the face &amp; kicking him in the stomach @UMassAmherst. Ercelik then was seen grabbing the student’s Israeli flag, spitting on it, stabbing it with a chef’s knife &amp; throwing it in the trash. https://t.co/mmcl3wzPgs https://t.co/ESoIv7Pm6D"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_AkOVpXAAAVJgU.jpg",
    "index": 68,
    "text": "These two women (probably students) just defaced the Israeli product section at our Columbia University @Columbia @BarnardCollege store. They also tried to intimidate our cashiers. Please help identify them. https://t.co/XS2BYIOq01"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_GmkPnWQAANUc9.jpg",
    "index": 73,
    "text": "Dr. Alhusain Aly serves as a physician specializing in Internal Medicine at the Veterans Affairs Southern Nevada Healthcare System located in North Las Vegas.\n\nShockingly, Dr. Aly labeled the October 7th Hamas terror attack in Israel as \"resistance\" and claimed that \"Zionist Israel has no future whatsoever.\"\n\nAre Jewish patients safe in this man's care?"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_JvbdlXIAAWXPQ.jpg",
    "index": 75,
    "text": "This is what @RepDanGoldman @danielsgoldman &amp; staff confronted when they showed up to work today. It is a direct result of his speaking out against anti-Semitism &amp; supporting Israel’s right to self-defense. Defacing his office is not a form of protest, it is a deplorable crime. https://t.co/NqHHiNCtF9"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_MBZIdX0AA1s3i.jpg",
    "index": 77,
    "text": "The pro-Hamas mob is outside NYC’s Penn Station holding a large sign to make really, really clear that they endorse murder, rape and kidnapping. https://t.co/7YcLZ6Qofg"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_L11FZW0AAtmQ2.jpg",
    "index": 78,
    "text": "Be that person. Own it with pride. Let history remember your name.\n#HamasTerrorist  #HamasisISIS https://t.co/8zg8O5sjr3"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_OmtAXWAAArc2i.jpg",
    "index": 84,
    "text": "Really perfect exchange. No notes.\n\nThese rallies are clearly signaling support for Hamas\n\n“Do you see any signs explicitly saying they love Hamas?”\n\nYes. Here is one\n\n“he’s not wrong” https://t.co/qrsW0H1Sja"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_PlPVHWoAABtvP.jpg",
    "index": 85,
    "text": "What the Hell is happening to @ualberta? #ableg #cdnpoli #antisemitism https://t.co/nVZzFr6Q5F"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_9JQO_WoAAuZ_A.jpg",
    "index": 96,
    "text": "Bret Gustafson, Associate Professor at Washington University in St. Louis, says setting off gas canisters outside the homes of Jews is \"pretty cool\".\n\nLAPD are investigating it as a possible hate crime.\n\nAre Jewish students safe in his classroom @WUSTL @WashUChancellor?"
  },
  {
    "img_url": "https://pbs.twimg.com/card_img/1753913076833775617/U4T3njNd?format=png&name=small",
    "index": 2,
    "text": "A woman in Indianapolis intentionally crashed her car into a building with a Jewish symbol. Only turned out the building belonged to Black Hebrew Israelites, an antiSemitic hate group. \n\nShe managed to screw up her own hate crime. \n\nhttps://t.co/khPRq1bud7"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-pf5qqXwAE-4Ko.jpg",
    "index": 4,
    "text": "We learn hate for Israel on TikTok and Instagram say young protesters https://t.co/pTjwVMtYWe https://t.co/BHmvsElv92"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Smf2RWMAA0g9R.jpg",
    "index": 5,
    "text": "\"Palestine is winning the PR war!\"\n\nThe audience: https://t.co/OOzpLZQhJQ"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEo1_oCWYAABeLz.jpg",
    "index": 0,
    "text": "Our memorial to the victims of Hamas on 7/10 in Brighton has been attacked ten times. They have stolen and broken this sacred site over and over. Tonight we built back bigger and brighter. The hateful won’t beat us. Never again. https://t.co/LjHskNzos4"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9if0C0WQAAM_Lw.jpg",
    "index": 4,
    "text": "Broadway producer James L. Simon tears down Israeli hostage flier in NYC https://t.co/Ll8nPrfMlh https://t.co/Nnb2fDYstR"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F99l4giboAA7i1a.jpg",
    "index": 14,
    "text": "Meet West Village, NYC resident Jose Javier Diez Medrano.\n\nJavier was caught tearing down posters of Israeli children kidnapped by Hamas terrorists into Gaza. https://t.co/1tHnJjTgda https://t.co/l7TYImXokN"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-ILAOAW8AAYdU8.jpg",
    "index": 18,
    "text": "Meet Olivia Lynch from brooklyn. another Tearing off posters of missing children's, and finding it funny some how. the found out started. https://t.co/kQ2YYr1vZL"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-LczZsWcAA4NkF.jpg",
    "index": 20,
    "text": "The \"kidnapped\" posters have lured New York City's Nazis from under their rocks. One of them is Olivia Lynch of Brooklyn, who joyously rips down posts of kidnapped Jewish children.\n\nThat's Olivia Lynch of Brooklyn. Sorry, did I forget to say her name? Olivia Lynch of Brooklyn. https://t.co/hRhOhBpYmZ https://t.co/zoCDwhx0Pn"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-iK_k5WEAAEJ0w.jpg",
    "index": 36,
    "text": "A man spotted tearing down posters of kidnapped Israelis in the Meatpacking District, Manhattan. https://t.co/UlLk2r6gZN"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-hT0zLWwAAzUPr.jpg",
    "index": 37,
    "text": "#TraderJoes your employee is treating down kidnaped signs outside your UES location. She is erasing Hamas atrocities. Just as Holocaust deniers try to erase the Nazi atrocities.\n\nName and Shame! \n\n📍 Trader Joes, 405 E 59th St, Manhattan, NY. https://t.co/03LsguCIVu"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-xVryrWwA4IY8j.jpg",
    "index": 43,
    "text": "From outside CUNY Law in Long Island City this afternoon. Clinically, silently cutting down hostage posters, with nothing but a chilling stare for the man asking him to explain his demented actions: https://t.co/RjCc0sIlm1"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-2CCNoWgAA26xw.jpg",
    "index": 49,
    "text": "12 years old. Right now at Amsterdam and 95th in New York. No words. https://t.co/f8QO7rikB4"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_FL39nWIAAd0gk.jpg",
    "index": 59,
    "text": "Today, this woman destroyed posters of Israeli civilians kidnapped by Hamas.\n\nShe did it in Westfield, New Jersey and also seemed very happy about it.\n\n@StopAntisemites \n\n🇺🇸🇮🇱 https://t.co/5qSHNKEMWc"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ESg1RbEAA6CQq.jpg",
    "index": 60,
    "text": "Near Baker Street these two heartless idiots were pictured tearing down the posters of kidnapped Israelis.\nWhen confronted they said those on the posters ‘weren’t even missing’. \nWhy is this happening? It’s just so cruel. https://t.co/qpvRUja22D"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_OG5TkWQAA2TaJ.jpg",
    "index": 63,
    "text": "Last night local Jewish ppl and Israelis in Brighton put up a display of child hostages held by Hamas. Every single one was ripped down by this morning. The pro-Palestinians can’t countenance even the sight of these innocents for half a day. Evil. https://t.co/ipWmedplPz"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_oa7hiXkAA8aQg.png",
    "index": 74,
    "text": "🔴 Mackenzie Watson ripped down &amp; defaced posters in NY of Israelis kidnapped by Hamas and held hostage in Gaza. When confronted, Watson, who was adding to the poster w/ a marker, said, \"I’m proudly writing the death toll of the IDF\" https://t.co/IBTw2JdngZ https://t.co/LvNhKarxPJ"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_yUV0tWAAAmibh.jpg",
    "index": 75,
    "text": "This woman was caught ripping down an Israeli child 'Kidnapped Poster' this morning in Mill Hill Park. Do you recognise her? Let us know. https://t.co/4QKXKREefH https://t.co/dW5T5Ey29o"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEnjF9gXAAAcduy.png",
    "index": 1,
    "text": "Nada Hammouda, a PhD student at UT Southwestern Medical Center, posted on LinkedIn, “Zionism is a war on children: Child sex and organ trafficking for sadistic, pedophiliac pleasure as well as profit.” @UTSWNews https://t.co/mpw894yf18 https://t.co/LlTwl42bcC"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEiYHT4acAEe7mw.png",
    "index": 2,
    "text": "This is what reportedly awaited the @Harvard student body for the new spring semester. Every single Israeli hostage poster defaced. Will interim president Alan Garber take action against antisemitism at Harvard? https://t.co/qvBWmpA0nx"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEnmNfnXQAAerVC.png",
    "index": 4,
    "text": "Why would @Harvard's new prez Alan Garber appoint Prof Derek Penslar to its new antisemitism task force (created to identify \"the root causes\" of antisemitism at Harvard)? Garber called Israel an \"apartheid regime\" & defended fmr prez Claudine Gay. He is a root cause! https://t.co/y5l8CXd7ms"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEicCMPWYAAaVZW.png",
    "index": 5,
    "text": "Aziza Zahran, a care manager at Catholic Charities of Onondaga County's Children's Health Home, says, \"Israel is...a colonialist imperialist power killing indigenous people to steal their land, Stop naming it. Stop validating it's existence...\" https://t.co/rupbjmGKPF https://t.co/GsLwbhIOGF"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEkHxk2WUAAhSPI.jpg",
    "index": 6,
    "text": "BREAKING: for the first year since he took on his role as Secretary General of the UN in 2018, António Guterres will not participate in the annual Holocaust Remembrance Day at NYC Park East Synagogue on Saturday. https://t.co/Oxr9BsUWrH"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEdpXfLWoAEEQUs.jpg",
    "index": 7,
    "text": "\"Zionism is a war on children: Child sex and organ trafficking for sadistic, pedophiliac pleasure as well as profit.\" - Nada Hammouda, a PhD candidate at the University Texas Southwestern Medical Center \n\nThis is just a small tidbit of the antisemitic blood libels Hammoud has posted recently on her LinkedIn page.\n\nCan you imagine being a Jewish colleague of hers?"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEaPXvaWcAElivA.jpg",
    "index": 8,
    "text": "Sickening - California based artist Safia Latif (@safialatif) not only promotes the  10/7 Hamas massacre but has the audacity to monetize it via “art”. \n\n- Over 1200 people were butchered on 10/7\n- Countless women & girls as young as 12 were raped by Hamas\n- Victims beheaded\n\nAnd Safia Latif made $1000 glorifying it all."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F97jG0DXQAAPhZp.jpg",
    "index": 11,
    "text": "BDS claims that Anti-Zionism has nothing to do with Antisemitism.  \n\nVandalizing the Shorenstein Aleichem Cultural Center in the Bronx with the words ‘Free Palestine’ is not only Anti-Zionist. It’s antisemitic. \n\nCelebrating the mass murder of Jews  (“resistance); calling for the mass murder of Jews (“globalize the intifada”); committing mass murder against Jews (October 7)…\n\nAll of these are not only Anti-Zionist.  They’re Antisemitic."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-Rrum6WMAAps-r.jpg",
    "index": 14,
    "text": "NYC - we are horrified to see Physician's Assistant Mariam Abdelghany with @NYCHealthSystem share a graphic on Instagram portraying a Jew depicted as an animal eating a baby, with what appears to be a Palestinian child watching from the side.\n\nAbdelghany's NYC Health System profile -https://t.co/hCQSBODbBL - \n\nAbdelghany's LinkedIn archive - https://t.co/d3yhSXvsHy"
  },
  {
    "img_url": "https://pbs.twimg.com/card_img/1754835083356237824/omUDnoM-?format=jpg&name=small",
    "index": 15,
    "text": "What percentage of you have heard of this event? I’m guessing less than 1%. If we want the world to see the #antisemitism we experience, we have to report it ourselves. \n\n@UMass student arrested for punching #Jewish student at Hillel vigil https://t.co/wDwMKwih6A via @JTAnews"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-lSUuaWAAA-e_A.png",
    "index": 21,
    "text": "A black male suspect wanted for allegedly spitting on a Jewish woman and calling her antisemitic slurs on Nov. 5 in Spring Valley, N.Y. has been arrested. https://t.co/SRRilMqRm5 https://t.co/sqyCOA0Jmk"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-lMzAkXoAE0lJa.jpg",
    "index": 22,
    "text": "An absolutely appalling antisemitic attack in downtown Toronto, targeting @chaptersindigo and Jewish CEO Heather Reisman. This is the tragic new reality for Jews in Canada. Condemnations simply won’t cut it anymore. https://t.co/0QqUqM3FA1"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-514ntW4AErpy-.png",
    "index": 28,
    "text": "Hey, @ucsc. At a time when antisemitism is rampant on college campuses, why would you hire as a NEW PROFESSOR Jennifer Mogannam, a former activist with @sjpucsd, who has encouraged a violent Intifada, defended terrorism &amp; spread anti-Israel propaganda? https://t.co/8ks5MM3f8S https://t.co/Z5I7Pyw6aZ"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_q1c9HaYAAWrnd.jpg",
    "index": 31,
    "text": "After they were done trying to stop the Macy's Thanksgiving Parade, Hamas supporters vandalized the NY Public Library in Manhattan\n\nNotice the part they targeted recognizing Stephen A. Schwarzman, a Jewish businessman who donated $100 million to renovate the facility in 2008 https://t.co/O9lB449iRx"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEnwQkYbIAA_haa.jpg",
    "index": 1,
    "text": "This is getting completely ridiculous, we’ve found yet another @NHSuk doctor who is spreading disinformation about the 7th Oct massacre.\n\nDr. Oraizi Jafery claimed that the October 7th Hamas terrorist attack was a \"false flag operation.\" He also spreads global domination conspiracy theories. Cc @bedfordhospital @IDMedical\n\nhttps://t.co/d84lqZFonl"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEnrD1ZW0AAkg-M.jpg",
    "index": 0,
    "text": "Oh look \"defund Israel now\" is a pro-Hitler and Nazi account.\n\nWhat a surprise! https://t.co/guerEgyDUs"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEdNMLtXAAA5Eqb.jpg",
    "index": 1,
    "text": "3 Jewish friends have been attacked by a gang of 20 men in central London for speaking Hebrew. \n\nThe gang came up to them shouting ‘Are you Jewish?’ with one of the victims saying ‘Yes, I’m Jewish.’\n\nMoments later the Jewish friends were punched in the head and neck while the attackers chanted ‘Free Palestine.’ \n\nOne of the victims called the police 10 times in fear for their life with the operator dismissing their urgent calls for help saying ‘You are not the only one calling tonight.’ \n\nIt took officers 28 minutes to arrive on the scene despite the incident occurring in the popular tourist area of Leicester Square, where police are always present. \n\nOne of the victims needed hospital treatment after the attack. \n\nThe attack took place around 1:30AM on Sunday morning and is now being treated as an antisemitic hate crime by the Metropolitan Police. \n\nSource: Daily Mail"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9DPuzoXAAAvRjS.jpg",
    "index": 3,
    "text": "In Paris, two young men poured gasoline on and set fire to the front door of the apartment of an elderly Jewish couple. \n\nThe Paris prosecutor's office opened an investigation into the fact of causing damage by dangerous means for religious reasons. The suspect Mohammed B. was sent to a psychiatric hospital for evaluation."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9SOduqWgAABOto.jpg",
    "index": 4,
    "text": "Losing my mind. https://t.co/s2pJt0aPAQ https://t.co/pBsnMt5XBa"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9Q6dGJXAAEl204.jpg",
    "index": 5,
    "text": "Thinking back to Woke Kristallnacht of 2020 https://t.co/WYjUJo04W8 https://t.co/C03ZtjRGmC"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9Y8OJhW4AAKGAd.jpg",
    "index": 6,
    "text": "Fahima Karim, a student at @UAInst and Marie Andersen, a student at WUM. https://t.co/3K2fyladLh"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9ldHV0aoAA7TUD.jpg",
    "index": 11,
    "text": "Oxford educated Pakistani senator, ladies and gentlemen. Scrote. https://t.co/Hh0b1sLikP"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9uHhhQWEAAGRRx.jpg",
    "index": 15,
    "text": "I still remember Western news outlets glorifying her and her family… https://t.co/nF3ebNWKcn https://t.co/FcwqRf16Bl"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F90fyOvXwAA4p2r.jpg",
    "index": 19,
    "text": "Meet Mehak Quereshi, a UX designer in London whose goal is clean the world of Jews. https://t.co/ylYg5oQIOB"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F92wSooWwAAP4mv.jpg",
    "index": 20,
    "text": "Someone attacked the Jewish cemetery (Zentralfriedhof) in Vienna last night.\n\nA building was set on fire and a swastikas and the face of Adolf Hitler were also spray painted on the cemetery wall.\n\n🇦🇹🇮🇱 https://t.co/Nxa31enZVe"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F93qE-MWgAA8476.jpg",
    "index": 22,
    "text": "Branding the homes of Jews continues in Buenos, Aires. \n\nSo far these incidents have been reported by the hundreds in Germany, France, Russia, and Argentina. https://t.co/mVydbDXPol"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F97qKX6XsAA9C5W.jpg",
    "index": 23,
    "text": "Cantor's Deli, Los Angeles https://t.co/bmzXt3pq1J"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F99BHwOWIAAo9uh.jpg",
    "index": 26,
    "text": "Mehak Quereshi\n\nMarie Andersen\n\nFahima Karim https://t.co/Y6d96jKTYD"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-HGTtZW0AAiYP3.jpg",
    "index": 27,
    "text": "Alert: Authorities in Lyon, France are looking for a suspect after a 30- year old Jewish woman was stabbed in her home. The perpetrator left this Swastika on the door.\n\nhttps://t.co/VgiCXIMbpb https://t.co/nbuwEjKFeQ"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-HkVioWEAAq6AH.jpg",
    "index": 29,
    "text": "The image that has been appearing on posters at “anti-Israel” demonstrations around the world - of someone binning a Star of David - looked familiar to me.\n\nAnd I was right - this is from a 2013 @CST_UK document.\n\nIt only took a decade for the far-left to copy the far-right. https://t.co/Gvo3HfsCIM"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-FvKg9WgAA_wSn.jpg",
    "index": 30,
    "text": "Antisemitic attack against Jewish family business in Paris.\n\nThe texts says:\n\n“Jews out” and “entry forbidden for Jews” followed by an arrow leading to the store’s entrance.\n\nWhat’s going on in France?\n\n🇫🇷🇮🇱 https://t.co/PnnoKV4sVI"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-Lowa9XYAAkx8j.jpg",
    "index": 33,
    "text": "DC - a young woman holds up a sign during yesterday’s pro Palestinian rally that depicts ridding the world of the sole Jewish nation. https://t.co/fw12WrrE45"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-M-cstXcAAht5p.jpg",
    "index": 35,
    "text": "Chicago, IL - look at a woman gleefully posing with the Hamas flag for a photo during an anti Israel rally in Evanston yesterday.\n\nThe support we are seeing for Hamas, a maniacal and genocidal terror regime,\nIs truly astonishing. https://t.co/vuf0VrLwPM"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-WChqUWgAQqrnh.png",
    "index": 38,
    "text": "Molotov cocktail thrown at a synagogue in Montreal. \n\nNever Again is Now. https://t.co/7dWKmjDq5p"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-ZN3AqWYAAxfXF.jpg",
    "index": 40,
    "text": "Graffiti in Belgrade, Serbia, at the entrance of Jewish NGO school Haver.\n\nThe graffiti says “Free Palestine”, “Israel kills people” and “Haver leave Serbia”. https://t.co/MOuEDUmGwS"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-gWbi-W0AAS_22.png",
    "index": 45,
    "text": "lord have mercy\n\nCanadian pro-Palestine activists planned an event on the 85th anniversary of Kristallnacht and advertised it with posters showing people smashing windows.\n\nIt's just anti-Semitism all the way down. THEY'RE CALLING FOR KRISTALLNACHT. https://t.co/wjWfhH7Xhx"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-hM0evX0AAk20T.png",
    "index": 47,
    "text": "Tonight is the 85th anniversary of Kristallnacht, \"the night of broken glass,\" a nationwide pogrom led by the paramilitary wing of the Nazi party in which hundreds of synagogues and thousands of businesses were destroyed in mob violence. \n\nPro-Palestinian students have distributed posters calling for a National Day of Shutdown featuring images of broken glass on this day on the McGill campus in Montreal."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-havIFXgAEjRtX.jpg",
    "index": 49,
    "text": "https://t.co/ubNGBZGH1W https://t.co/0FH5mp0Dvx"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-iO4eyWIAAU44l.jpg",
    "index": 54,
    "text": "Baby-faced vandals spray-paint swastikas, ‘Hamas’ graffiti on Upper East Side rooftops https://t.co/DnIplLTd3a https://t.co/fnpszEtx42"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-m4vdwWkAA4p8v.jpg",
    "index": 55,
    "text": "They told Jews to “go back to Palestina!”\n\nSo we did, built a thriving Jewish nation and now, they want us to leave, “go back to Poland!”\n\nThey don’t care where we go, they just want us to not have any home to go to. https://t.co/3yZw2Ti7S5"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-nbToIXQAE2KBq.jpg",
    "index": 56,
    "text": "Saint Louis, Missouri - a woman was spotted at a Ballwin anti Israel protest holding up a Nazi-esque sign wanting to rid the world clean of Jews.\n\nRecognize her? DM us! https://t.co/vnSqwMYx6P"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-qWLm7XgAAFuFp.jpg",
    "index": 59,
    "text": "Netherlands - the woman holding up this Nazi era sign of wanting to “clean the world” of Jews has been identified as University student Zara Hussein. https://t.co/oMTjJAjFNG"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-p0vKsWUAEmRAY.jpg",
    "index": 60,
    "text": "This isn’t 1930 Europe, it’s 2023 London. \n\nMy non-Jewish friends are telling me to hide at home. https://t.co/fbIPzVrvWw"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-qm87RXEAApPmg.jpg",
    "index": 61,
    "text": "We are saddened and disgusted by the antisemitic vandalism that defaced the memorial in Copenhagen honouring the heroic efforts to save Danish Jews from the Nazis.\n\nThis type of hate cannot be tolerated in today's society. https://t.co/q0lUp1ZlOC"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-vdOSIXkAA_uoJ.jpg",
    "index": 67,
    "text": "Horrifying- a @hinge user received the following vile antisemitic rant from a female user on the dating platform. https://t.co/EwHA9eNDEb"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-upDwiWIAASZdO.jpg",
    "index": 68,
    "text": "NYC parent, teacher groups promoted pro-Palestine student walkout: Kids yelled ‘F–k the Jews!’ https://t.co/NMBLHGnzg1 https://t.co/jM3kxAc2kB"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-uuh2pX0AAqYLs.jpg",
    "index": 73,
    "text": "Jeremy Corbyn is preparing a tweet to condemn antisemitism and Islamophobia https://t.co/sdCIKzdxRJ"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-0ys85XoAAYJFy.jpg",
    "index": 75,
    "text": "\"I hope your ancestors died in ovens and it will be the same for you and your family soon during a 2nd Shoah (fingers crossed). When that happens, I'm going to sh*t on Israeli flags while dancing.\" - Amaury Letort, a senior project manager for @Punchcut  (Brooklyn location) \n\nContact Punchcut to voice our concern about this dangerous antisemite: press@punchcut.com"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-0KbQ5WsAAPHAP.jpg",
    "index": 76,
    "text": "https://t.co/U907b8hiUr"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-4R3GLbcAAIaDu.jpg",
    "index": 77,
    "text": "I’m relieved my grandmother isn’t here to see this. She was the only survivor in her family, at 13 years old. She couldn’t bear the sight of the swastika, let alone see Jewish headstones covered in them. \nWhat is happening isn’t anti Zionism. It’s Jew hatred. No more excuses. https://t.co/qifMDqplHj"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_DhmwEWEAAHWrW.jpg",
    "index": 82,
    "text": "Waking up to these images from my local Starbucks at Bathurst and Eglinton in Toronto, an area w/ a large Jewish population. In case your struggling to read the hate graffiti, it says, “a cup of coffee, you mean a cup of blood”, “stop killing babies” and “blood on your hands”. This is the daily reality for Jews in Canada. Pleading w/ our leaders to do all they can to calm things down."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_G9jLEWwAAUP1w.jpg",
    "index": 87,
    "text": "Bloodthirsty mobs chasing Jews in the street and vandalizing Jewish businesses and synagogues while chanting for the mass murder of Jews.\n\nYeah, no similarities at all. 🤡 https://t.co/Dq4s4AHd9B"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_J_sCTWsAABq04.jpg",
    "index": 88,
    "text": "This is utterly chilling. From Sydney, Australia. https://t.co/UCIYUacDBI"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Lnn6ZWQAA9Sjt.jpg",
    "index": 89,
    "text": "An Italian mural of Anne Frank holding an Israeli flag was vandalized with the words ‘Gaza Free’…because desecrating the memory of a murdered Jewish child will definitely #FreePalestine https://t.co/rFKyIg41jo"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Trv3cXoAA6HDf.jpg",
    "index": 94,
    "text": "NYC - these atrocious antisemitic writings were spotted yesterday on the Q train @NYCTSubway \n\nThe handwriting appears to be from a female with a Cyrillic language background such as Russian. https://t.co/9h22K0PsWz"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Pk_cVagAAqVxx.jpg",
    "index": 95,
    "text": "I see one major difference between antisemitism on the Left vs on the Right:  scale https://t.co/NgkgTOQXFe https://t.co/utATRy6EH0"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Y3eWCXUAA0N9K.jpg",
    "index": 97,
    "text": "University of Chicago - Zillay Khan appears to be employed in the school's Physics department. \n\nIn her free time, she expresses disturbing views with statements like \"Hitler was right!\"\n\nCan you imagine being a Jewish student or colleague of hers? https://t.co/qYmremhfLA"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ZJiwaawAAtP97.jpg",
    "index": 98,
    "text": "Left: Nazi executing a Jewish woman with her child in Ivanhorod, 1942.\n\nRight: CCTV screenshot of Hamas Nazi executing a young Jewish woman cowering, pleading for her life, in Kibbutz Alumim, 2023. Video below.\n\nNever Again Means Destroy Hamas. https://t.co/soGSu2dH3W"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_bPezBXQAAq2B3.png",
    "index": 99,
    "text": "Three radical anti-Israeli activists were arrested for setting fire to an Israeli-owned defense company's factory in New Hampshire this morning.\n\nOne of the activists had previously worked to map out Jewish preschools and other Jewish institutions in Boston. (1/2) https://t.co/W596v0pcNU"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_d5JHiWgAAimdK.jpg",
    "index": 100,
    "text": "Calla Mairead Walsh, a central figure in Boston's \"Jew Mapping Project\" was just arrested after vandalizing Elbeit, an Israeli owned business.\n\nWalsh, along with two others (Bridget Irene Shergalis and Sophie Marika Ross), spray painted the building with red paint to mirror blood and smashed windows.\n\nThey were charged with riot, sabotage, mischief, trespassing, and disorderly conduct."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_fNV_PXEAA2CBi.jpg",
    "index": 101,
    "text": "Attacker in anti-Jewish beating shouts ‘free Palestine’ as family accuses judge of being racist during wild NYC sentencing hearing https://t.co/TzOnwyMPJz https://t.co/aTdF6jNkJl"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_mpxg6bsAA48cQ.jpg",
    "index": 105,
    "text": "Pro-terrorist children in Australia openly calling for genocide and supporting terrorist groups on the streets of Melbourne. \n\nWho's at fault?\n\nThe education system? \n\nExtremist activist teachers? \n\nRadical Islam?\n\nLabor Governments for not nipping this in the bud?\n\nTik Tok? https://t.co/raOiQUShsT"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_rWl6NaQAA-Uit.jpg",
    "index": 107,
    "text": "The deputy leader of The Greens posted a photo with a child who was skipping school to hold a sign calling to “keep the world clean” of Jews.\n\nLet that sink in. https://t.co/Zt1l7QhrT4"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ppYctakAA9omL.jpg",
    "index": 108,
    "text": "On Thanksgiving, pro-Hamas activists committed a terroristic hate crime in Brentwood, throwing smoke bombs at &amp; vandalizing the home of the national president of one of America’s leading Jewish organizations. This is what happened in Nazi Germany before the ovens and crematoria. https://t.co/mxpvWwsOkf"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_zw47bXkAAtqxd.jpg",
    "index": 110,
    "text": "This man was standing in front of a synagogue in Dallas, Texas today.\n\n@StopAntisemites https://t.co/jPl6YPxkp0"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_0orWMWMAAg0SM.jpg",
    "index": 111,
    "text": "@DavidWeprin @ChaskelBennett @HillcrestHSNYC Please comment on this . This was on a Q49 bus 🚌 that serves East Elmhurst &amp; Jackson Heights . Just awful 😢 https://t.co/tvrnyTfo69"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_299SWXYAACjcW.jpg",
    "index": 113,
    "text": "The pro-Hamas mob smashed the window of a New York kosher restaurant. Because, you know, terrorizing Jews in America will #FreePalestine. https://t.co/WUEDQsgTVg"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_4WRljWkAAYA7e.jpg",
    "index": 114,
    "text": "Red Cross in 1944: “We found no trace of installations for exterminating civilian prisoners in Auschwitz” 👇\n\nRed Cross in 2023: “We found no evidence of weapons or hostages being kept in hospitals in Gaza” https://t.co/lRUb8iQcFs"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_6cNYUWwAAwEsz.jpg",
    "index": 115,
    "text": "Gigi Hadid has reached a new low - she is now spreading an antisemitic blood libel that Jews harvest the organs of Palestinians.\n\nIt's time to break ties with this outrageous antisemite once and for all @IMG @IMGmodels"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_6AXnaW8AAUknP.jpg",
    "index": 116,
    "text": "University of Florida - the Chabad student Jewish center was vandalized on Friday November 24th with horrifying antisemitic graffiti including \"BURN IN HELL\" AND \"CHILD MURDER\".\n\nVideo surveillance (in thread) shows a white male, medium build with what appears to be blonde/light hair."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_9DJz9XwAEOCky.jpg",
    "index": 117,
    "text": "This neo-Nazi disinformation agent who is based in the UK &amp; has no real connection to America posted a list of current and former Jewish members of Congress and just labeled them “foreign agents”.\n\nThese members do not have dual citizenship. https://t.co/gwV8e1ZKpm"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9-dydVWMAAth8M.jpg",
    "index": 0,
    "text": "Just don’t pretend later you didn’t know who you were promoting… https://t.co/WzD1c92t5h"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-QnqxsWYAA28hT.jpg",
    "index": 3,
    "text": "All Bernie did in this clip was say Hamas is not interested in peace, is unwilling to maintain a ceasefire, and ultimately has to go. \n\nIt's bizarre that we're still arguing over whether there are people who support Hamas. https://t.co/0Rg2bvLCO2"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-uAcJgWkAArF3X.jpg",
    "index": 8,
    "text": "This guy came into my comment section making some bold claims.\n\nHamas and their fellow travellers want to do this. They explicitly talk about it.\n\nWestern leftists are so, so sure that what Hamas really want is just peace and equality\n\n🙄🙄🙄 https://t.co/wFOH8226Pu"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-2CCNoWgAA26xw.jpg",
    "index": 10,
    "text": "12 years old. Right now at Amsterdam and 95th in New York. No words. https://t.co/f8QO7rikB4"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-7TFtKXsAAB38z.jpg",
    "index": 11,
    "text": "Some “anti-Israeli protester” in New York City has smeared feces on the poster with the face of the 12-year-old Israeli boy Yagil Jacob.\n\nHe was kidnapped by Hamas on October 7th. https://t.co/yQOZZ031Gs"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ExgufX0AAoDM3.jpg",
    "index": 15,
    "text": "University of Pennsylvania - a series of posters mocking kidnapped Israelis and comparing hostage victims to cows were spotted all over campus.\n\nWe have no words regarding the cess pool of Jew hatred that has infested UPenn under the failed leadership of President Liz Magill. https://t.co/SNIyz8ark8"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_EHd78WwAAj-zr.jpg",
    "index": 16,
    "text": "This was allegedly posted by a doctor at @SickKids Hospital.\n\nBelieve it or not, this is one of the milder anti-Semitic posts I've seen from Canadian doctors.\n\nAnti-Semitism in medicine isn't new, but it's time to have an honest discussion about it.\n\n#Cdnpoli @cpso_ca @CIJAinfo https://t.co/A0K8CdgO4i"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_OgWouXoAAGQMP.jpg",
    "index": 18,
    "text": "MTA boss shouts ‘f–k Israel’ and ‘f–k you too’ at woman with Israeli flag https://t.co/sdJdmZmOdO https://t.co/bGIeeN2lMh"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_8p0M4WIAAusGA.jpg",
    "index": 23,
    "text": "The video this person is referring to is the one Hamas live-streamed to the world of my husband’s family being held hostage. Where siblings cry for their murdered sister and a father is broken before taken. I have received a lot of horrible messages since 7/10. This is inhuman. https://t.co/5yPFFsJIjq"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_6ZAMPaAAAOTnL.jpg",
    "index": 0,
    "text": "Gigi Hadid posting the centuries old antisemitic blood libel that Jews harvest the organs of Christians, or in this case, Israel routinely steals organs from dead Palestinians.\n\nLike many other PA libels, it contains a small grain of truth that has been distorted into a lie:\n\nIn 2001, an Israeli investigative journalist exposed that from the years 1988 to 2000, in violation of Israeli law, doctors at the Abu Kabir Institute of Forensic Medicine had taken body parts for research and transplants of skin and corneas without permission from the relatives.\n\nMost body parts were taken from Israeli Jews, but also from Israeli Arabs, Israeli soldiers and Palestinian terrorists.\n\nAt the time, the institute was run by Prof  Yehuda  Hiss  who was personally involved in the scandal. Hiss was removed from his position as director but remained as chief pathologist until later investigations uncovered that he had continued his misconduct, which led to his dismissal from the Institute by the Ministry of Health in May 2012.\n\nThere has been no documented case since then and this was all done illegally under the direction of one rogue individual."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_07gv4bAAAt-GH.jpg",
    "index": 0,
    "text": "Is Israel supposed to take these people's word on creating a one-secular state?\n\nMuslims of India were also offered a one united secular India which they rejected. Asking Israel to give up its statehood and create one secular state with a heavy Muslim population. https://t.co/7MAUOXMHK3"
  }
]