[
  {
    "img_url": "https://pbs.twimg.com/media/GEl0fSoXoAAnLsV.jpg",
    "index": 1,
    "text": "Naama Levy. Noa Argamani. Shiri Bibas. Arbel Yehoud. Romi Gonen. Amit Buskila. Eden Yerushalmi. Carmel Gat. Doron Steinbrecher. Emily Demari. Daniella Gilboa. Agam Berger. Liri Albag. Karina Ariev. \n\nThese are the women being held by rapists. Say their names. Learn their stories. Bring them home. Now."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9DoKatXUAAloSp.jpg",
    "index": 4,
    "text": "Oded and Yochi Lifshitz, 83 & 85, of Kibbutz Nir Oz. They are proud Zionists and peace activists, dedicating their lives to coexistence and volunteering to drive children from Gaza to hospitals in Israel. \n\nNow they have been kidnapped by Hamas to Gaza, Yochi ripped from her oxygen tank. The second photo is the remains of their piano after Hamas burned down their home. #BringThemBack"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9FMCawXEAAG6ln.jpg",
    "index": 5,
    "text": "The Boston Jewish community encouraged families to “adopt” a hostage to pray for until they’re released. \n\nMy fiancé and I chose Fernando Marman. He moved to Israel from Argentina and was with his family in Kibbutz Nir Yitzhak when terrorists abducted him.\n\nPray for Fernando. https://t.co/QfE6NlB9QO"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-lGuuEbIAAOQZi.jpg",
    "index": 6,
    "text": "Held hostage: Yehudit Weiss\n\nYehudit hasn’t been heard from since the morning of Oct 7, when she and her husband, Shmulik, were in their Kibbutz Be’eri safe room. Hamas terrorists shot Shmulik. \n\nYehudit’s phone was later traced to Gaza. She had been undergoing treatment for breast cancer before Oct 7.  Yehudit needs to come home now. \n#BringThemHomeNow"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_KvIlgWUAAs20i.jpg",
    "index": 9,
    "text": "Hamas killed another Israeli hostage. \n\n86 year old Aryeh Zalmanovich is shown in a Hamas video— dead, with black and blue marks throughout his arms and a blurred face with a rag visible around the mouth. He looks gagged.\n\nThe elderly man appears to have been tortured before he was killed."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_QLqNSXsAA8--i.jpg",
    "index": 11,
    "text": "Gali Tarshansky is 13-years-old. \n\nShe has been in the hands of Hamas for 6 weeks now. Imagine what life has been like for this girl.\n\n#BringThemHomeNow https://t.co/0JCHKnm0Mq"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_QgqRWbAAAfFn5.jpg",
    "index": 12,
    "text": "Maayan Zin’s daughters Dafna, 15, and Ela, 8, were kidnapped by Hamas and are currently being held hostage. \n\nIn an op-ed, she writes: \n\n “I have nothing left to ask of this world but this: Take me to my girls. Take me to Gaza. I am requesting assistance from the Israeli government, the U.S. government, the International Committee of the Red Cross and any other organization trying to help the hostages. I cannot wait for more news of hostage deals to come and go. \n\nYou have failed to free my girls, so take me to Gaza. My bag is packed. I will take only a few items: chocolate milk that my daughters love, shoes that are good for running, and a new bandage for Ela — the last photograph we have of her in captivity shows that she is injured. Take me to Gaza so I can change her bandage.\n\nIn my jeans pocket I will carry a photograph of Noam, their father, who we believe was killed in front of their eyes. Take me to Gaza in his memory.”\n\nPaywall Free Link: https://t.co/Sv4WvOO66f"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Q58qXWEAA-b4O.jpg",
    "index": 13,
    "text": "This is the mother of 19-year-old Noa Marciano, a hostage murdered by Hamas 💔 https://t.co/ODZSh1ZOvf"
  }
]