[
  {
    "img_url": "https://pbs.twimg.com/media/GEoUCnuX0AAb6il.jpg",
    "index": 0,
    "text": "The most special fairy in heaven. The images of the monsters on your body can't get out of my head.\nso sorry. They will pay. https://t.co/q0aXhazqUo"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEjencpX0AArUrl.jpg",
    "index": 1,
    "text": "It's a story about murdered love. A heartbreaking story about Yvonne and Antonio. They met at a Colombian party, he saw her and fell in love and they became inseparable. They were happy people, it is said that they were like a ray of sunshine that shone on everyone around them. Each of them ended up in a relationship with a child and they became one warm and happy family. They went to the Nova music festival with some friends, they left the children with Antonio's parents. When the shooting started, she called her brother and told him in a frightened and terrified voice: \"They are shooting at us!, they are shooting at us! They are blowing us up\". The family then tried to call them several times but she did not answer anymore. In the shelter, grenades were thrown at them, they were seriously injured when a terrorist entered and shot all the wounded repeatedly. A survivor from the shelter said that Antonio was slowly dying for several hours. They had no chance. The two small children were waiting for them at home, Antonio's 7-year-old daughter Manuela and Yvonne's 4 and a half-year-old son Aviel. For many days they did not know what had become of them until the news arrived. The social workers and psychologists told the children that mom and dad had died. It's a sad story, about Yvonne and Antonio who loved to dance salsa, loved to be happy and entertain. But most of all they loved little Manuela and Aviel. It's a story about a family that Hamas monsters murdered in an instant, it's a story about small children crying. This is a story about Antonio and Yvonne - in life and in death they were inseparable."
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEi5p1wWsAALlOM.jpg",
    "index": 2,
    "text": "Hayim Katsman, 32, an American-Israeli lecturer on philosophy, politics, and Israeli society, was murdered in Kibbutz Holit on October 7.\n\nHe and his neighbor, Avital Alajem, were hiding in a closet together in his home, and when they were found he shielded her with his body; she survived. \n\nShe was then taken by Hamas militants to Gaza along with another family’s 4-month-old baby and 4-year-old boy. \n\nAt some point in the terrifying ordeal, their captors abandoned them. Avital took the children and managed to make her way back to the kibbutz.\n\nHayim was active in several local peace organizations, including Mahsom Watch, which monitors the impact of government activity on Palestinian lives.\n\nHe was also a talented landscaper, car mechanic, musician, and DJ. \n\nMay Hayim’s memory forever be a blessing."
  },
  {
    "img_url": "https://pbs.twimg.com/media/GElsQqFXEAAEr9D.jpg",
    "index": 3,
    "text": "yelizbeta was born in Leningrad a few months after the end of World War II. All her life she lived in poverty and suffered from anti-Semitism. She really loved her garden in the small apartment where she lived in Ofakim and every day until the last day she would go out to the garden and tend it. This is a story about yelizbeta who always took care of those around her, was very caring and loving. On October 7 at 06:40 she sent her daughter a message: \"Rita, there are a lot of alarms and booms and there is nothing on the news. It is dangerous for the neighbors who have to take small children out so early in the morning and stand in a stairwell during the alarms\". yelizbeta did on that terrible morning what she had done all her life - cared for others. She decided to go open the door and call the neighbors to come and hide from the missiles in the protected room of her house. But when yelizbeta opened the door, a ruthless Hamas monster murdered her with unimaginable brutality and left her bleeding to death in the doorway of her house. yelizbeta had no chance, she never reached the neighbors. This is a story about the 78-year-old yelizbeta, who was a complete world. She loved her family, had a big heart, was wise, modest and had a charming smile. This is a story about yelizbeta, who never hurt anyone, yelizbeta that in the terrifying moments of the morning of October 7th thought of others and most of all, she wanted to live."
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEd6swVXMAAIWCL.jpg",
    "index": 4,
    "text": "When the missile attack began, Shani and her friends left the festival in the car and started their way home. Shani did not know that in those minutes thousands of armed terrorists infiltrated the festival area. Near road 232 there were mortar shells falling, Shani and her friends were directed to enter the shelter on the side of the road. They immediately did so, only they had no idea that in a few minutes, they would go through hell. When they went inside, terrorists arrived and started throwing grenades at them inside the shelter. Shani and her friends repelled the first grenades and when they already thought the nightmare was over, the terrorists sprayed them with gunfire. At a certain point the terrorists stopped the shooting and pulled out those who remained alive. The terrorists grabbed Shani and her roommate who came with her to the party and dragged them wounded and bleeding into the van. Shani came to the festival to celebrate the role she got in a new job she was accepted to. After long days of searching, uncertainty and endless worry, the family received the bitter news.  The terrorists murdered her and her roommate in a van on the way to Gaza with unimaginable cruelty. Imagine this, being held captive in a two meter shelter, surviving a grenade attack and close range shooting, being injured, kidnapped and then brutally murdered along the way. Imagine the last moments of Shani, who had a whole life ahead of her, and especially many dreams that she would never fulfill. Rest in peace Beautiful Girl, no one will hurt you anymore."
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEXyBzXWQAA-mXf.jpg",
    "index": 5,
    "text": "He survived the Holocaust but not the Oct 7 massacre.\nMoshe Riddler, 92, was the oldest resident of Cholit community. \"From the moment he moved there he was like the tribe elder, everyone knew him for his sense of humor\", his grandson shares.\nHe escaped an extermination camp when he was 9 but lost his entire family in the process. \nRiddler was murdered in the murderous terrorist attack along with his senior helper, Pietro Bosco, a foreign worker from Moldova.\nRather than growing old with dignity, Moshe was murdered in cold blood. It's horrific to think that he was struck by such terrible cruelty again."
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEY4VY6XUAAfMIU.jpg",
    "index": 6,
    "text": "Baruch Dayan HaEmet\n\nIDF intelligence confirmed that 19 year old Staff Sgt. Shay Levinson of the 7th Armored Brigade's 77th Battalion was killed &amp; his body abducted by Hamas on October 7.\n\nMay his memory be for a blessing https://t.co/2Df6InrvIn"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9zFPI9XsAAhWTI.jpg",
    "index": 8,
    "text": "Eyal Waldman, an Israeli high-tech tycoon, founder CEO of Mellanox Technologies, created research and development centers five years ago first in Judea and Samaria (Palestinian) and then two years ago in Gaza, employing hundreds of Arab Palestinian developers.\n\nHe used to say then: \"We have a lot of employees in Gaza today. There are talented and smart people out there, economically it will pay off. We have good staff, within a time zone, highly motivated, accessible and opportunities. \n\nAnd I believe this is very important to bring the two nations together. People used to be afraid of each other and didn't talk. But the positive is created when people start working together and see tension being reduced and cooperation working. It's good for all sides.\"\n\nOn October 7, 2023, Palestinian terrorists came from Gaza and murdered his 24 year-old  daughter Danielle less than a mile from where her father opened the most innovative factory for Gazans."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-fQfzbWUAA8uh-.jpg",
    "index": 9,
    "text": "Eden Levi, a hero, will stay 19 years old forever.\n\nHer base was the only base near the Gaza border not taken over by terrorists on October 7th because of her heroism.\n\nShe successfully fought off 10 terrorists with RPGs, grandes, and automatic weapons. \n\nShe was killed but saved her whole base."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-ju8lja0AABzg7.jpg",
    "index": 10,
    "text": "These are the faces of Israeli children slaughtered in their homes, burned alive, brutally tortured and murdered in front of their parents by Hamas terrorists. https://t.co/oquqICnwxE"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-jVH8EboAAQvyk.jpg",
    "index": 11,
    "text": "Sigal Etach🕯️\n\nSigal was murdered by Hamas at the Supernova music festival on October 7. When terrorists attacked, friends offered her a spot in the car to flee, but she stayed behind to look for a friend she didn’t want to leave alone. \n\nHer family searched the country for four days, desperate for any news of her, before finally being informed that her body was found.\n\nMay Sigal's memory forever be a blessing."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-ryuCFXEAA8jYB.jpg",
    "index": 12,
    "text": "Chen Nachmias 🕯️\n\nChen's unit was called to Sderot early on October 7 after Hamas attacked and engaged in a fierce gun battle with terrorists. \n\nChen was shot twice, yet continued to battle. A friend recounted: “He kept firing. He finished all the bullets in his sniper rifle, moved to the pistol, finished all the bullets there, called in backup. Only afterwards did he collapse.”\n\nHe leaves behind a wife and four young children. May the memory of this hero forever be a blessing."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-2WsSLW8AAqoZo.jpg",
    "index": 13,
    "text": "Vivian Silver 🕯️\n\nEarly on Oct 7, Vivian wrote to say that terrorists had infiltrated her kibbutz and entered her home. She hid behind a cupboard door. Nobody heard from her again. \n\nIt was thought that she was kidnapped to Gaza, but her body has now been identified.\n\n74-year-old Vivian was an Israeli peace activist and leader of Women Wage Peace. For years, she volunteered to drive ailing Gazans to Israeli hospitals. \n\nShe was one of Israel’s leading progressive activists.\n\nVivian was a great blessing in life and I have no doubt her memory will forever be a blessing 💔"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-4T1OeXcAAf8em.jpg",
    "index": 14,
    "text": "After 5 weeks, the body of the Canadian-Israeli peace activist Vivian Silver has been identified.\n\nShe spent years driving Gazans in need of medical care to Israeli hospitals.\n\nRest in Peace Vivian\n\n🇨🇦🇮🇱 https://t.co/fIcpjPMOOn"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-0lvuIXwAA0baO.jpg",
    "index": 15,
    "text": "Israel Chana 🕯️\n\nIsrael was out walking his dog with his girlfriend, Shahaf, early Saturday morning — his 30th birthday — when air raid sirens began to ring. Not long after, they heard gunshots.\n\nShahaf recounts: “Everyone started to panic and hide, and Israel and I were standing on the street and suddenly we saw [the terrorists]. Israel didn’t think twice, he went to go get his personal weapon… and went with another 15 or so civilians and started to search for the terrorists.”\n\nHe left the house in flip flops and with just 15 bullets in his pistol against heavily armed swarms of terrorists. He didn’t come back.\n\nA neighbor said that she saw Israel “alone against a cell of terrorists” and that he was running and hiding and shooting at them, “getting their focus on him so that they wouldn’t infiltrate into houses… he killed one terrorist and he seriously wounded another.”\n\nIsrael died a hero. May his memory forever be a blessing."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_APECQXEAAMFkA.jpg",
    "index": 16,
    "text": "Yosef Winner, a Holocaust survivor, writes:\n\n\"My name is Yosef Winner and I am 97 years old. I survived the flames of the Nazi beasts. My entire family perished in the terrible inferno. I was cut off from my deep roots. Out of exhaustion, despair, drowning, I clung to the ground and planted roots in Zion. \n\nI married Aviva and we raised two wonderful children - Ofer and Nurit. From Ofer and Michal, I have 4 grandchildren in Kfar Aza. From Nurit and Miki I have 6 grandchildren in Kfar Aza too. I arrived at a large and well-planted family tree in the homeland. A tree that bears fruits.\n\nBut suddenly, the events of 7.10.23 emerged from among the fences of evil. The gruesome sights of fire and dust, the horrible killing and murder of innocents came to me again. \n\nMy dearest grandson Yahav was murdered while protecting his wife Shai-Li and his one-month-old daughter, Sheya. And my dearest granddaughter, Hadar, and her husband, Itay, were murdered while protecting their ten-month-old twins, Roy and Guy.\n\nAgain I am exhausted, in despair, drowning.\""
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_EVu-3XgAAwZlx.jpg",
    "index": 17,
    "text": "Moshe Shuva and Yuval Baron🕯️🕯️\n\nMoshe and Yuval were murdered by Hamas terrorists at the Supernova music festival on October 7. Yuval and Moshe had planned to get married on Valentine’s Day. Instead, they have been buried side-by-side.\n\nMay their memories forever be a blessing. https://t.co/szLSH61kUF"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_GMH8bWUAAJqld.jpg",
    "index": 18,
    "text": "Lior Hadad Atias 🕯️\n\nLior was murdered by Hamas terrorists at the Supernova music festival on Oct 7. She was there as a volunteer to provide counseling and emotional support to anyone undergoing a mental health crisis.\n\nLior is survived by her husband and 6-year-old daughter.\n\nAt her funeral, her husband said that Lior’s name means “my light” in Hebrew - and that was perfectly fitting to her personality. “Lior brought light into every room she entered. It sounds like the kind of thing you say in a eulogy, but everyone here who knew her, knew well that it was true.”\n\nMay Lior's memory shine brightly and may it forever be a blessing."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_J4tILW0AEysXB.jpg",
    "index": 19,
    "text": "May Naim🕯️\n\nWhen Hamas attacked the Supernova music festival on October 7, May fled to nearby Kibbutz Be’eri. Her body was found inside a shelter holding on to her close childhood friend, Lotan.\n\nMay had served in a military intelligence division. Her mother said: “She worked around the clock in order to provide the fighters with the best intelligence, she played a role in hundreds of operations… but when she was in crisis, attacked by terrorists, nobody saved her.”\n\nMay this beautiful girl’s memory forever be a blessing."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_QHQbSXgAAAZU7.jpg",
    "index": 20,
    "text": "Staff Sgt. Yam Glass🕯️\n\n20-year-old Yam was an observation soldier who was killed when Hamas terrorists stormed her base near Kibbutz Nahal Oz on October 7.\n\nHer mother said at her funeral: “My Yam’chik, our angel, how can it be that your life journey is over?...We talked about your plans for the future, we planned a girls’ trip together…Who will call me every day?”\n\nMay Yam's memory forever be a blessing."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_OGqJ5WkAA7W2a.jpg",
    "index": 21,
    "text": "This time six weeks ago, Israeli families  were being ruthlessly slaughtered.\n\nHamas stormed the home of the Hetzroni family in Kibbutz Be'eri and murdered 12-year-old Liel, her twin brother Yanai, cousin Ayala, and grandfather Avi before setting the house on fire;\n\n07. 10. 2023 💔"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_T5PKJXEAAcaQ6.jpg",
    "index": 22,
    "text": "'I want to kiss dad.' In the aching stillness of grief and longing for a presence now absent, a child lies on the grave of his father who was massacred by #Hamas terrorists on October 7th.\n#HamasMassacre https://t.co/UuknTpG4UT"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_szZwYXIAAr7FM.jpg",
    "index": 23,
    "text": "This little girl’s body was burned so badly that it look forensic archeologists more than six weeks to identify her.\n\nAll that remains of 12 year old Liel Hetzroni is ash and bone fragments. \n\nMay her memory be a blessing.\n\n@UN_Women \n\n#NoExcuse #HamasMassacre https://t.co/rPGOjG26l3"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9N8tsEXsAAXLHw.jpg",
    "index": 2,
    "text": "\"Mama?\"\n\n                 \"Yes?\"\n\n\"I don't feel so good.\"\n\n                 \"I know. It's over soon.\"\n\n\"I need water.\"\n\n                \"You can drink soon.\"\n\n\"Mama?\"\n\n               \"What is it, my beauty?\"\n\n\"Do you think they also killed other people in the kibbutz?\" https://t.co/O2DvzTkLce"
  },
  {
    "img_url": "https://pbs.twimg.com/card_img/1754301080198905856/t93WtJW5?format=jpg&name=small",
    "index": 10,
    "text": "Israeli police have collected eyewitness testimony of gang rape by Hamas terrorists - horrifying but very important report by my colleague @JoshBreiner in @haaretzcom. \n\nNever, ever forget what Hamas did on October 7.\n\nThe full report in the link below:\n\nhttps://t.co/lS0pJBI6pe"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-wWy8sW0AAnSo8.jpg",
    "index": 12,
    "text": "Hamas had a detailed plan for the raping of Israeli girls; including which Hamas commander would rape girls in the different locations in Israel.\n\nAn Arabic-Hebrew sheet found on the Hamas terrorists included words meant for sexual assault like “take down your pants.” https://t.co/5HQh4jYSNd"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-0hLGyXYAAd3tL.jpg",
    "index": 13,
    "text": "Today is November 13. On October 7, Hamas committed one of the worst terrorists attacks the world has ever seen. South First Responders has  released new footage of young people who were murdered at the NOVA music festival. \n\nAs time goes on, do not forget why this war started and what the “pro-Palestinian” rallies, which have not disconnected from Hamas but are flying their flag, stand for. \n\nhttps://t.co/SlUnb7HHMO"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F--Y5thWoAA7rcn.jpg",
    "index": 18,
    "text": "I just saw the screening of the Hamas footage with members of the Knesset. Iman Khatib-Yassin was there. Last week she expressed skepticism. But in the screening she was shaken, and she left early, literally staggering out, steadying herself on seats as she made her way out. https://t.co/dLgchR9DeK"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Pg006WcAANQhP.jpg",
    "index": 24,
    "text": "This is what Hamas did to Israeli women\n\nVia @MarinaMedvin https://t.co/NXfA72g9C4"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_PybccXkAEu7-O.jpg",
    "index": 25,
    "text": "Fox News is reporting on the eyewitness accounts of brutalization of women by Palestinian terrorists. https://t.co/X6ZmvfFYc9"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_evDZCakAAPEpq.jpg",
    "index": 32,
    "text": "Last night, I heard a 20-minute testimony from Ella Shani, survivor of the Kibbutz Be'eri attack on October 7. I, and the entire audience, was in the tears by the time this brave 14-year-old girl told us her story.\n\n*100 people from her kibbutz of 1,200 were killed\n*She hid in her home with her family from 6:30am until 5:30pm, when the IDF came to save them\n*Terrorists tried to break in five times during that day\n*On her kibbutz WhatsApp group, teenagers pleaded for help\n*She had to shield her little brother's eyes from the pools of blood and dead bodies (including children and a 10-month-old baby) that had been tortured on the way out\n*Her 16-year-old cousin Amit Shani was kidnapped and is still being held hostage in Gaza\n*Her father died of his injuries.\n\nShe did not cry once during her speech. She is in survival mode, going around and telling her story, shouting it so that people hear about what really happened that day.\n\nNo 14-year-old should have to endure this. I pray to Hashem that they bring Amit home, that Ella can heal from this horrible trauma, and that the Jewish people never have to go through anything like this ever again."
  },
  {
    "img_url": "https://pbs.twimg.com/media/GElJS4JacAAz6fS.jpg",
    "index": 0,
    "text": "HEROES: This 24-year-old girl, Captain Yuval, a logistics officer in the NAHAL Infantry Brigades found herself driving in her car in pajamas on OCT 7 racing to her unit at Kerem Shalom near GAZA & Egypt. Along the way, she was ambushed and killed 2 terrorists on motorbikes while firing a 9mm out the window and driving... 🤯 \n\nWith her unit non-responsive and mostly dead, when the extent of the event started becoming clear to her after seeing masses of terrorists, car after blown out car, and dead bodies everywhere, she gathered herself amidst the chaos and decided to set up an emergency command post nearby on a small farming community to re-organize what as left of her soldiers who had mostly been killed and bring in more. Her efforts included helicopter support and reservists coming in by rushed cellphone calls landing in the fields of the farming community.\n\nThey assembled a full combat field command post to enter the fighting, including by air and rescue Israelis under siege by Hamas, it was active FOR 2 WEEKS at the start of the war. 👀 \n\nCaptain Yuval, 24.\nHave you ever heard so such a people as the nation of Israel?  🇮🇱"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F8mYDI-XIAMXMVx.jpg",
    "index": 1,
    "text": "Meet Tali Hadad, Israeli hero and national treasure. \n\nHer son was injured by Hamas terrorists in Ofakim. Ignoring the danger, she rushed to pick him up and drive him to a medical center. \n\nThen she turned around and drove back toward the danger to rescue more of the injured. She made the trip 3 times under fire and ultimately saves 12 lives. \n\nTali says: \"I'm not comfortable with the word heroine. I am a responsible citizen. The real heroes are the soldiers.”\n\nTrust us Tali, you’re a hero!"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-sKmy9XgAA2Ces.jpg",
    "index": 3,
    "text": "On the morning of Oct 7, these four soldiers – Idan, Elia, Ido and Nitzan – heard gunshots. They climbed into their tank and advanced toward Gaza where they saw hundreds of terrorists spilling over the border. \n\nThese four heroes fought for 24 hours, took out 80 terrorists, and prevented another massacre in nearby villages."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_na2TtWMAAQ3bW.jpg",
    "index": 4,
    "text": "I don’t have the details and I don’t know who he is or what the story was but I’m told it’s true. \n\nThis solider carried around a book psalms with him and that book ended up saving his life by protecting him from a bullet. 🇮🇱✡️ https://t.co/ALCF6JO2PV"
  }
]