[
  {
    "img_url": "https://pbs.twimg.com/media/GEn0x_qWkAAL-nK.jpg",
    "index": 0,
    "text": "There are several issues that I have with this video clip\n\n1. Israeli army is right now about 6-7 kilometers away from the Al Mawasi humanitarian safe zone (see the recent map from January 21 below), the ground forces of IDF are not in Al Mawasi or anywhere near. There is no existing sniper rifle that can cover that long range (mostly they are good for along shot between 1000-1500 meters, rarely slightly farther)\n2. We can hear automatic gun fire in the video, not a single shot fire that sniper rifle produces, which implies we hear a machine gun fire (like M-16 or Kalashnikov) and effective range for those are between 500 to 550 meters for M-16 and 350 meters for Kalashnikov.\n3. The clip is edited between the time we hear gunshots and we see the body - it misses several seconds of the footage and these are important seconds, because during these seconds the person was hit with a bullet\n4. We do not see on the video any armed person, we do not have a clear visual on the body either, the angle does not allow us to see where he was hit and from which direction, what we see is that he is covered with a white piece of cloth and dragged to a nearby area behind the fence\n\nOverall: we do not have enough data to reach any conclusion on who shot him right now"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEnJGbZXYAA6rHe.jpg",
    "index": 1,
    "text": "\"All the logic of the universe can not explain the contradictions in this picture\""
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEhtqxaWoAARCjP.jpg",
    "index": 3,
    "text": "@orenbarsky we shouldn't forget https://t.co/vvITKEFBMS"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEk-5tCXEAEp8FQ.jpg",
    "index": 4,
    "text": "A professor at @Harvard_Law (with +150K followers) spreading a lie that I deleted my tweet history. \n\nThey could have simply checked to see that this is false, but I guess antisemites can't be bothered with the truth. \n\nAre these are the kinds of people that teach at @Harvard? https://t.co/m1OwbC9pOz"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F93XdH4XIAAWe66.jpg",
    "index": 7,
    "text": "Hi @elonmusk 👋\nThis footage is from a hospital in Syria, bombed by Assad. You surely remember the riots in many cities last week after the fake news that Israel bombed a hospital. \nThis 👇 is spread by the most influential account on X. If people die, X will be blamed.\n_ https://t.co/46Pkozz2B6"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F925SCjWoAAla7v.jpg",
    "index": 9,
    "text": "Super cool how people on this platform can post videos of Assad's war crimes in Syria, claim that it's actually Gaza, and then delete it after 500,000 people have seen it with absolutely no consequences. https://t.co/ZCHgxlq7cB"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-gO-H3WAAIk2MH.jpg",
    "index": 12,
    "text": "This widely shared video, viewed at least 8 million time, claims to show an IDF helicopter kill Israeli civilians at the Supernova festival on 7 October.\n\nThe claim is completely unsubstantiated. The video, released by the IDF on 9 October, shows its helicopter engaging Hamas. https://t.co/ojHsjhlBMH https://t.co/WgDdGuTn4E"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-fCkdAX0AAfMHv.jpg",
    "index": 14,
    "text": "Interesting. https://t.co/3xeQtLYsJH"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-pL2QSXkAAxixN.jpg",
    "index": 15,
    "text": "Why did you delete this, @KhaledBeydoun? https://t.co/ell9yGSSgB"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-0ySctXkAAjAbc.jpg",
    "index": 17,
    "text": "This is an image from Homs in SYRIA after the ASSAD regime's siege. It is not Gaza.\n\nThis user is an Assadist who has routinely denied Assad's war crimes for the past decade. \n\nShe does not care about Palestinians. She wants to protect the illegitimate Syrian regime's image. https://t.co/2UIabSQvcv"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-7H-IZWUAA1IRf.jpg",
    "index": 18,
    "text": "Bella Hadid posted a photo of this Palestinian child 👇\n\nExcept that he is from Yarmouk, Syria 🇸🇾, bombed by Assad regime. Assad killed hundreds of thousands of civilians.\n\nBut nobody cares. Carry on.\n\n#NoJewsNoNews \n_ https://t.co/56qsRQE6wT"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_SDTTAXwAAc2qo.jpg",
    "index": 20,
    "text": "New York Times published this photo saying it is from Gaza. Small problem: the bus is an Israeli bus company. The photo is from Israel.\n\n@nytimes is officially a parody account 🤣 https://t.co/AqOOZ4cEAn"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ezg0CWIAAH-jz?format=jpg&name=small",
    "index": 22,
    "text": "Original images. These are some of the Hamas terrorists who perpetrated the Oct 7 massacre"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ptvf0W4AA84Ay.jpg",
    "index": 24,
    "text": "Sky News correspondent now community noted. This has not been a good day for Sky, to put it very mildly. https://t.co/aqJqbEgCGw"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_vPbzKWgAABq0Z.jpg",
    "index": 25,
    "text": "These Holocaust-denying scumbags can’t decide whether Israel killed their own people or no one was killed and Israel stole a bunch of dead bodies. \n\nOf course we know most of the Israelis killed and have plenty of evidence of who killed them, but that won’t stop these idiots. \n\nAs for the bodies at Al Shifa, Israel had to check them to look for the hostages. They found 2 dead hostages in the area."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_1LszSWEAAK0mD.jpg",
    "index": 26,
    "text": "I've been researching anti-Israel propagandists, who  borrow their tactics from Black Lives Matter activists. \n\nMuch like BLM activists used instances of excessive force by individual police officers to call for the dismantling and defunding of the entire police force in the U.S. in 2020, anti-Israel activists have used similar instances of excessive force by individual Israeli soldiers to call for the destruction of Israel. \n\nOr, like in the example below corrected by Community Notes, anti-Israel propagandists often lie to give the false impression that Palestinians are under constant attack by Israeli soldiers, when this is plainly not true.\n\nWe did not give in to activist demands to dismantle the police and we're not going to let Hamas take over Israel."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_76mD1XsAACDBV.jpg",
    "index": 27,
    "text": "All the images in this tweet, which claims to show children in Gaza finding their pet cats upon returning to their destroyed homes, are AI-generated.\n\nThe images first appeared in a TikTok video by an account that regularly shares AI-generated images from Gaza. https://t.co/edvkHxWdGS"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-brFPfW4AAvCtn.jpg",
    "index": 4,
    "text": "Brazilian Security Authorities with the Support of Mossad have reportedly managed to Arrest the 2 Hezbollah Leaders of Plot to launch Attacks against Jewish Communities and Synagogues across Brazil, while also Recruiting more Terrorists to their Cause for further Attacks in the Region; the Plot is said to have been planned by Iranian Intelligence and Executed by Members of Hezbollah."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F--kVCLW0AAZHeC?format=jpg&name=large",
    "index": 8,
    "text": "Community notes strikes hard https://t.co/0zHkmN40zV"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_GQo84XcAAITZ2.jpg",
    "index": 10,
    "text": "This poll will be ignored, downplayed or excused by the @NYTimes, @CNN, @AP, @reuters,  @nbcnews @cbsnews @TIME @abcnews .\n\nBut this is the real obstacle to peace. Not \"occupation\" or \"siege\" or \"nakba.\" For over 100 years, Palestinians relish seeing Jews murdered."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_lNnHaXoAEj-RP.jpg",
    "index": 12,
    "text": "Theo van Gogh was a Dutch film director.\n\nHis 2004 short film, Submission: Part 1, written by Ayaan Hirsi Ali, criticised Islam’s treatment of women.\n\nShortly after, Mohammed Bouyeri killed him, and pinned a note on his dead body with a knife, threatening Ali, the West and Jews. https://t.co/INce6ptjKU"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_eaTofWwAA9yRG.jpg",
    "index": 0,
    "text": "This is another poor attempt at trying to prove that there was a \"Palestine 🇵🇸\" in 1933.\n\nThe document is an immigration permission issued by British Mandatory Palestine.\n\nThe document also contains Hebrew text and says א״י which stands for Eretz Yisrael, Land of Israel. https://t.co/1SHzdRR9wK"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_iK7woWYAANznf.jpg",
    "index": 1,
    "text": "Except for this. https://t.co/rQsW3SLQWc https://t.co/boevUxDBRM"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_O547GXcAAZB6k.jpg",
    "index": 0,
    "text": "Last month, Muslim group CAIR and various influencers made a story go viral about a Muslim man in Ohio who said he was seriously injured by a car driven by a person who screamed \"Kill all Palestinians\" and \"Long live Israel.\" Northridge Police investigated & determined it was a hate crime hoax. They say they found surveillance footage showing he actually was injured in a fight with his brother. \n\nHesham Ayyad (the alleged hoaxer) & Khalil Ayyad have been charged with domestic violence and assault. Hesham is additionally charged with falsification, making false alarms & obstructing official business. Muslim Americans have long been involved in numerous high-profile hate crime allegations that turned out to be hoaxes, especially since Trump was elected. #HateHoax https://t.co/GpDRVQlUDe"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_iN4KaXEAAYzv5.jpg",
    "index": 4,
    "text": "Fact:\nThere is no a single Palestinian detainee in Israel who's under 14,\n\nSource:\nB'tselem https://t.co/YsVrGkxG1n https://t.co/3vtT4wSlIE"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_uE6WUW8AAawzA.jpg",
    "index": 8,
    "text": "Absolutely despicable. \n\nGigi Hadid just posted the below to her millions of followers falsely accusing Israel of abducting, torturing, raping children.\n\nHer example was Ahmed Almansara. \n\nHere is video of Ahmed and his cousin running through a Jewish settlement looking for people to stab, settling on critically stabbing a 13 year old boy and another man."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ruGlSWgAAo4Br.jpg",
    "index": 9,
    "text": "Lol even the UN disagrees with your bulshit https://t.co/ImZ1Vt8hvP https://t.co/5iAgDNh6Z0"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_zNbzcW0AA79Pc.jpg",
    "index": 11,
    "text": "Jamal Abu Hamdan was arrested for throwing stones and being a Hamas member,\nNot \"for praying in a mosque\"\nTry again with the whitewashing\n@SanaSaeed https://t.co/ojGCMIfjAY https://t.co/pl8nPnyEXB"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_0usWlWEAAFIwd.jpg",
    "index": 14,
    "text": "The implication of @mtracey's libelous post is that Jews only care about fellow Jews. This has been disproven by the actual posters of the Thai &amp; other non Jewish hostages.\n\nIt's also outrageous because the people tearing down the posters are only doing it because they hate Jews. https://t.co/ccc2spgSFU https://t.co/OUKKQYDQ7j"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_2-1iSXgAAJrjY.jpg",
    "index": 17,
    "text": "Tirana Hassan heads @hrw. On Oct. 17, her Omar Shakir said Israel bombed a hospital and killed 500. “I've been to morgues, but the scenes I'm seeing...at a loss for words. Abject horror.”\n\nTurn out it was all a lie. They admit it was the Jihad. But look at her weasel words now: https://t.co/eaZBr3Zb1p https://t.co/grf3fp15oW"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_8sHkbWIAAQKBy.jpg",
    "index": 18,
    "text": "This photo collage has gone viral on X, claiming to show how Israel mistreats Palestinian children while Hamas is kind to Israeli children.\n\nThe image on the right doesn't show an Israeli child. It's from a Hamas parade in Gaza in 2021, and the child in it is Palestinian. https://t.co/ukMC8LIA3P"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_91BfIXIAAlVZE.jpg",
    "index": 20,
    "text": "Meet Jason Eaton, the monster who shot 3 Palestinian students in Vermont.\n\nHe is not a Jewish.\nHe has nothing to do with the Jewish people nor nation.\n\nBut that didn’t stop antisemites Simi and Haze Khadra (of ‘SimiHaze Beauty’) from falsely labeling the shooting a “Zionist hate crime” on their IG story. \n\nTime to rid your stories of this bigoted brand @Sephora"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-k5bErW4AA25oa.jpg",
    "index": 3,
    "text": "“I’m a Muslim Israeli soldier. I really hope that the world will see that Arab soldiers are proud to serve in the Israeli Defense Forces” https://t.co/kkZMOTMGgO"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_qLkXtWkAAPfvj.jpg",
    "index": 6,
    "text": "A recent poll conducted by a Palestinian media outlet found that 93% of Arab residents of Jerusalem prefer to remain under Israeli rule and would not give up their Israeli identity card\n\nHmmm… What are they aware of that has been overlooked by those protesting Harvard students? https://t.co/7kqeHKE3fN"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEmFvYfbUAAzUAr.jpg",
    "index": 0,
    "text": "“hOw MuCh iS iSrAeL PaYiNg YoU” 🧌\n\nIt costs $0 for me to stand against musty terrorists https://t.co/iiCEkcaQp2"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F98v-DHWEAAyucn.jpg",
    "index": 2,
    "text": "Smart words by @leekern13. https://t.co/dpG9dKKxea"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-GkkBRXcAAabdd.jpg",
    "index": 4,
    "text": "Did the Jews take land from Arab Palestinians in the 1940s? Was there a “dispossession” of Arab Palestinians by Jews?\n\nNo.\n\nBut Jews did buy land, legally, from Ottoman/Turkish landowners. Arabs sold the land (above market rate) to Jews. Some of the renters/tenants were upset their landlords sold off the land to Jews. But that’s not dispossession. These are the people who today are known as Palestinians and who claim they have an original interest in Israeli land. They never claim they own it, by the way— they just claim their ancestors lived on it. \n\nBTW Israel keeps all the land purchase records on file in a safe place. All land was lawfully acquired from Arabs under their own laws. https://t.co/gnXhF5yOMU\n\nDon’t let the Rashida Tlaibs of the world lie to you."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-QYu6sXYAAOngV.png",
    "index": 5,
    "text": "Hi @CNN, @IvanaKottasova &amp; @zeenasaifi. \n\nIs this 27-year-old Ibrahim Abu Sneineh the same ~27-year-old Ibrahim Abu Sneineh from the same East Jerusalem area who attempted to stab Jews at a market?\n\nThe info is public. No need to wait for police comment.\nhttps://t.co/qWJVV9zAnp https://t.co/sM76DAJYnk"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-yLXHNXIAAXVh8.jpg",
    "index": 8,
    "text": "The first Jews settled in Yemen 2651 years ago.\n\nBefore WW2, around 70 000 Jews lived in Yemen\n\nToday, only 1 Jew remains in the country\n\nHis name is Levi Salem Marhabi and he is being hold captive by the Iranian-backed Houthis\n\nHe has been tortured and is now partially paralyzed https://t.co/Fi9B9nmL0t"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_fkuGhXwAAikEi.jpg",
    "index": 0,
    "text": "This is pure ignorance. Putting everything else aside, 900000 Jews that fled to Israel post WWII were expelled, often forcefully, from Arab-majority countries. Plenty of Jews were native to the region and can trace their connection to the land back hundreds of years. https://t.co/AHUO0vASue https://t.co/xEwHjTeOhR"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_iq6lpXgAAKu6T.jpg",
    "index": 1,
    "text": "Will it change the minds of the Hamas herd?\n\nOf course not. https://t.co/IkORJ1uDg7"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_lakhgasAAJNzB.png",
    "index": 2,
    "text": "Hi @AliVelshi: I'm a Middle Eastern Jew. \n\nWhich one has the real apartheid: the State of Israel where Arab-Israelis live as equal citizens or the Arab world which expelled its Jews? \n\nAlso, do the Palestinians allow Jews to live among them? https://t.co/R9O2eLa9SL"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEdepKYWIAggrK-.jpg",
    "index": 0,
    "text": "Dunno who said it, but it’s spot on. https://t.co/KC4GI8OwFX"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-LHIJSbcAA78CS.jpg",
    "index": 2,
    "text": "My dad, who is a moderate Muslim, finally expressed his concern and asked me, 'Why are you supporting this genocide?'\n\nHe mentioned that he's stopped looking at his phone because he can no longer bear to watch videos of Palestinian children being bombed by Israel.\n\nI replied, 'I empathize with the suffering, and it's not easy for me either.' \n\nThen I showed him a photo, and we both agreed on the gravity of the situation in Palestine.\n\nI then informed him that the photo was actually of a Yemeni child pulled from the rubble resulting from a Saudi bombing in Yemen.\n\nI pointed out that Israel has allegedly killed 7,000 Palestinians, while the Saudis have killed at least 150,000 Yemeni Muslims. Some estimates suggest upto 300,000.\n\nHow can we call the current conflict a 'genocide' when what the Saudis did is hardly even discussed by Muslims? Don’t get me started on 200,000 Muslims killed by Bashar Al Asad in Syria.\n\nHe responded that if that's the case, he also disagrees with what the Saudis did. I replied, 'How convenient. Nearly half a MILLION fellow Muslims have been killed by other Muslims, and you didn't even know about it. Yet when Israel retaliates against a terrorist organization that has killed, raped, and maimed 1,500 of its citizens, the whole Muslim world reacts?'\n\nIt seems to have less to do with preserving Muslim lives and more to do with a religious fantasy of hostility toward Jews."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_eMz27XMAAIo8g.jpg",
    "index": 5,
    "text": "The fact the IDF is a defensive army and has never once initiated a war is significant and deserves more recognition.  \n\nIf Israel wanted to do what some of the media would have you believe Israel wants to do, Hamas would be no more, Hezbollah would be no more, and truthfully, Gaza would be no more. It would take hours, not even days, let alone months. \n\nBut that’s not Israel’s way, that’s not the IDF’s way, that’s not the Jewish way. \n\nRight now, Hezbolloh is playing with fire and attacking non stop in northern Israel, Hamas is trying to get in a win (aka dead Jews) before the hostage agreement kicks in, and Israel is basically under attack on multiple fronts. \n\nJust minutes ago, Hamas fired 10 rockets into Israeli towns. \n\nThis war would be over in about 12 seconds if Israel wanted it to be. \n\nDon’t forget that. \n\nNo other army on the planet would have the self control the IDF is displaying right now. \n\nLet’s just say, if it was in my hands, I’d have a lot less tolerance for this nonsense."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_fkWcNawAAxuue.png",
    "index": 6,
    "text": "one piece of evidence that you shouldn't trust the left's usage of the word genocide to describe the current conflict in gaza is that they've been accusing israel of genocide a decade lol https://t.co/naExcaDnru https://t.co/1ffZPZc7rF"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ohgEAWIAAbRIP.png",
    "index": 7,
    "text": "🧵A long thread worth your time to debunk Israel genocide in Gaza. Claims of genocide often rely on analysis by Raz Segal as an \"expert” on genocide. Analysis of his work and a group of recycled quotes by Israeli officials, now used by the media, shows it's all fabrication. 1/ https://t.co/i5M4PgWqQf"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEiIp8KboAE0tbo.jpg",
    "index": 0,
    "text": "From the BLM Hamas paraglider posts to the Nazi, terrorist symbols at their rallies, they're very transparent. https://t.co/7skGBHFuNl"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GElI3XYWoAAM7aa.jpg",
    "index": 1,
    "text": "@MarinaMedvin I don’t care what any politician in any government says…I support Israel because, well… https://t.co/hM9OAS4VQw"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9PrP4SWEAA5PSG.jpg",
    "index": 2,
    "text": "The Jewish Departure and Expulsion Memorial From Arab Lands and Iran reads\n\n\"With the birth of the State of Israel, over 850,000 Jews were forced from Arab Lands and Iran. The desperate refugees were welcomed by Israel.\"\n\nHere are their populations over time: https://t.co/DJ82zhb3eQ"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_FZb25WoAAfnu7.jpg",
    "index": 10,
    "text": "Amena Alkeswani is a 4th year Dermatology resident at the University of Tennessee Health Science in Memphis (@UTHSCMedicine, @uthsc).\n\nAttached are concerning social media posts made by Alkeswani in hiding “your Zionist folks are swimming in blood money” and blaming Israel for Hamas’ actions."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_JWehYWoAABkT2.jpg",
    "index": 13,
    "text": "UPDATE: the men involved in the brutal assault of Tulane Jewish students have been identified as a father and two son team:\n\n- Abraham Quraan (father)\n- Majdaleen Quraan (son #1 with mask)\n- Mohammed Quraan (son #2 without mask)\n\nAbraham is married to Sarab Quraan, who blamed the assault of Jewish kids at Tulane on the \"Israeli government\" and condoned her husband's and sons' actions.\n\nMore info on the family in thread."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_OlYaKWYAA50-o.jpg",
    "index": 15,
    "text": "So now that we have the full names of everyone who wrote this open letter denying, amongst other things, the fact Jewish Israeli women were raped and assaulted by Hamas-ISIS Jihadist terrorist, let me start with the first 3 women.\n\nSamantha Pearson from the University of **Alberta Sexual Assault Centre**\nSarah Jama\nSusan Kim\n\nThese 3 women support rape of Jewish & Israeli women and btw also deny Canada's right to exist in its current form(they sign the letter from \"so-called Canada\").\n\nIt seems they were very proud, \n@UAlberta do you support this? what is your stance regarding the rape and sexual assault of Israeli & Jewish women, that should be believed with 0 doubt but unfortunately was also recorded by Hamas, and has DNA proof?\n\n#Metoo\n#MeToo_UNless_UR_a_Jew \n#TheWestlsNext"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_Srx2sW8AAQ02-.jpg",
    "index": 17,
    "text": "Once an antisemitic Holocaust denier, always an antisemitic denier \n\nThe President of the Palestinian Authority Mahmoud Abbas (Abu-Mazen) just denied the massacre of Oct7, blaming Israel for murdering Israelis.\nJust one month before, Abbas blamed Jews for the Holocaust. https://t.co/JBCQBWMCw8"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_QlObqXkAA_UmP.jpg",
    "index": 18,
    "text": "Trita Parsi now appears to have deleted his blood libely post after it got 22k likes and 13k reposts. https://t.co/6UyveLOQvi"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_ezg0CWIAAH-jz?format=jpg&name=small",
    "index": 19,
    "text": "Original images. These are some of the Hamas terrorists who perpetrated the Oct 7 massacre"
  },
  {
    "img_url": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2023/11/Zainab-Chaudry.jpg?resize=789%2C460&ssl=1",
    "index": 20,
    "text": "A member of the Maryland Commission on Hate Crime Response likened Israel to Nazi Germany and said only \"fake Jewish babies\" were murdered on Oct. 7. Unsurprisingly, she works for CAIR, a terrorist front group whose founder openly supported Hamas.\nhttps://t.co/1VIPYa1kB0"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_kKAREaQAAuElF.jpg",
    "index": 21,
    "text": "The murdered raped and kidnapped came from an area of folks who worked, lived, and loved their Palestinian neighbors. And they are our families and friends. We’ve been agonizing for weeks so you can get goy validation and some likes on an app. Disgraceful! https://t.co/1ts2kERvQG"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_uE6WUW8AAawzA.jpg",
    "index": 22,
    "text": "Absolutely despicable. \n\nGigi Hadid just posted the below to her millions of followers falsely accusing Israel of abducting, torturing, raping children.\n\nHer example was Ahmed Almansara. \n\nHere is video of Ahmed and his cousin running through a Jewish settlement looking for people to stab, settling on critically stabbing a 13 year old boy and another man."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_yGs18WQAAPVCk.jpg",
    "index": 23,
    "text": "Israel released Asraa Jabes (in return for a child hostage). Palestinian accounts are sharing this photo 👇 to show what Israel did to her.\n\nThey conveniently don't mention that she has been burned when in 2015 the car bomb she tried to detonate burned instead of exploding... https://t.co/ElPnkX7khe"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_4DM-JWwAA7RUO.jpg",
    "index": 26,
    "text": "The same day Hamas began releasing Israeli hostages, supermodel Gigi Hadid posted a photo on Instagram falsely portraying Palestinian terrorist Ahmad Manasra as a \"child prisoner of war\" to her 80 million followers. Manasra was imprisoned when he was 13 for going on a stabbing spree on October 12, 2015, during the Knife Intifada with his cousin Hassan, 15. The pair critically wounded a 13-year-old boy and moderately wounded a 25-year-old man. \n\nThe spree ended when police shot Hassan and a passing motorist hit Ahmad. Ahmad was taken to an Israeli hospital. He admitted to investigators: “I went there to stab Jews.” He was later tried and convicted on two counts of attempted murder.\n\nIn her now-deleted post, Hadid claimed Manasra was \"abducted\" & randomly accused Israel of \"raping and murdering\" innocent people.\n\nhttps://t.co/ChVUygNm0z"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_02vZHW0AAIw9B.jpg",
    "index": 27,
    "text": "Vancouver, Canada\n\n🇨🇦🇮🇱 https://t.co/Iu9G1CS0Dg"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_-Iy29WgAAqSX9.jpg",
    "index": 28,
    "text": "THE MEDIA: This poor woman hasn’t seen her daughter in years - the evil Israelis imprison children &amp; tear apart Palestinian families. \n\nREALITY: This woman’s daughter is Shorouq Dwayyat; at age 18 she took a knife from her kitchen &amp; stabbed an Israel civilian in the head. https://t.co/8JzKg7KBnw"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F8THDZ3WUAAhOtS.jpg",
    "index": 0,
    "text": "The Association of German National Jews was founded in 1921 by a group of German Jews that supported Hitler. They lasted until 1935, when the founder (Max Naumann) was put in a concentration camp. \n\nUntil that point, they spent a lot of time telling other Jews how wrong they were to fear the Nazis."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-Ei1uTWYAAV7j3.jpg",
    "index": 1,
    "text": "Remember this?\n\nIf I were you, after October 7 I would have shut the fuck up and disappeared https://t.co/ySHKcM4rcb https://t.co/WCrWkF9aFE"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_sOJXCXYAATCLY.jpg",
    "index": 4,
    "text": "https://t.co/NBx2dCh5a2 https://t.co/0bkOk1TQ6b"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_61K89XwAAqDIO.jpg",
    "index": 5,
    "text": "1) It’s gross that Julia does this. A very small percentage of the people there are Jewish, but they use tokens to cover for their antisemitism. Linda Sarsour is front row. \n\n2) Julia’s communications director and chief of staff were recently exposed as having celebrated the 10/7 attack as it was happening in case you’re wondering the actual views she promotes around her. https://t.co/YZ5wV0xc8I\n\n3) Julia has her own history of lying about her biography that makes this even more gross. In a period of less than a year, Julia transformed her public persona from an open pro-Israel right-wing Christian to an anti-zionist socialist Jew (though her connection to Judaism is questionable and seems mostly to be invoked as a defense against accusations of anti-Semitism…) https://t.co/CftcjAg65s"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_3f_MsWEAA_DZt.png",
    "index": 0,
    "text": "@TiranaHassan But on Oct. 17, your rep jumped to slam Israel: “I've been to morgues, I've seen mass killings, anguish &amp; cruelty. But the scenes I'm seeing have left me at a loss for words. Abject horror. THIS MUST END.”\n\nWhere's your apology? Retraction?\n\nShame on you.\nhttps://t.co/jpUzCrmZKs https://t.co/m6pwCXM7MO"
  },
  {
    "img_url": "https://pbs.twimg.com/media/GEkbZFTWkAAtM51.jpg",
    "index": 0,
    "text": "Every time. \n\n27K retweets from hateful account showing injured child and blaming Israel when actual perpetrators were the mass murderers they support and celebrate. https://t.co/oCwmpZRuSc"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-4paz2XoAAltFB.jpg",
    "index": 6,
    "text": "@zahiahx @EylonALevy UNRWA literally made statements in both 2022 and 2021 stating that there were “man-made cavities” and “underground structures” on their school grounds. \n\nIn 2021 Hamas police literally kicked out UNMAS that had come to ensure the area was clear of explosives. https://t.co/sTd3Zg4ER1"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-9RjjOawAAxkSP.jpg",
    "index": 8,
    "text": "Look at this vile lie-spreader @swilkinsonbc. Check out the community note. https://t.co/W4w3QgjirR"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_dtJNrXwAAf4iG.jpg",
    "index": 10,
    "text": "The loons are still not sure whether they think 9/11 was good, or whether they think 9/11 was bad but the Zionists were to blame for it \n\n🙄🙄🙄🙄 https://t.co/LXMcdjNPBo"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-SV6H6WUAATo21.png",
    "index": 0,
    "text": "Meet UNRWA doctor Abedelmeneim Alshrafy, who posted on October 7th to mourn the \"martydom\" of his nephew, a Hamas terrorist. He also previously posted an image depicting Palestinian terrorists controlling the Temple Mount, with the caption \"Soon, if Allah wills it.\" https://t.co/lM0kBauXan"
  },
  {
    "img_url": "https://pbs.twimg.com/card_img/1755676442946342912/288V4lgU?format=jpg&name=small",
    "index": 2,
    "text": "🚨🚨🚨🚨\nImportant expose by @honestreporting: Photographers working for AP, CNN, NYT, and Reuters were EMBEDDED with Hamas on 10/7 and accompanied the terrorist group into Israel. They knew the attack was coming, and participated in it.\nhttps://t.co/HXVLHj0m6X"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-cTY9VWMAASNpR.jpg",
    "index": 3,
    "text": "Hassan Eslaiah, an AP/CNN photographer, with Hamas leader Yahya Sinwar. https://t.co/XflFFNoR75"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-elv0-XIAAfCaw.jpg",
    "index": 5,
    "text": "On the left is CNN photographer in Gaza 📸\n\nOn the right is a Hamas operative receiving a kiss from Hamas leader Yahya Sinwar 😘\n\nFun fact: They are both the same person. His name is Hassan Eslaiah.\n\nShame on you @CNN! https://t.co/E4qWQSgNpA"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-hfeBVW0AA5Qzo.jpg",
    "index": 6,
    "text": "5 years ago, @CAMERAorg sent a senior @AP editor evidence that Hassan Eslaiah \"openly identifies with Hamas' political platform and is a rabid anti-Semite who praises terrorists and expresses joy over the murder of innocent and unarmed Israelis.\" They knew. See 12/13/18 email https://t.co/oD30cHbCHJ https://t.co/TmQVzD1Ots"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_O6BKWXcAA__Zl.jpg",
    "index": 7,
    "text": "Hey @MSNBC.\n\nDo you recognise the man in the picture holding an AK-47? His name is Samed Wajjeh and the evidence points to him working as a cameraman for you in Gaza.\n\nDo you trust him to capture the story faithfully?\n\nDo you trust Wajjeh to point the camera in places that Hamas would find inconvenient? \n\nDo you not think that your viewers deserve to know who you are employing?"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_UlBfPXEAACwZJ.jpg",
    "index": 10,
    "text": "Everyone at Shifa hospital in Gaza who participated in kidnapping innocent hostages and hiding them in underground tunnels beneath the hospital are complicit in terrorism.\n\n@MSF_USA and @ICRC told us the medical teams didn’t know about it— they lied. All of them are complicit. https://t.co/eUoJso8W1g"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_eraK4WkAAiuFa.jpg",
    "index": 11,
    "text": "Farah Omar, a so-called journalist from the Hezbollah-affiliated @MayadeenEnglish, died in an Israeli strike in Southern Lebanon after a Hezbollah provocation. \n\nShe had previously not only celebrated the death of Israeli civilians on Oct. 7, but called for their number to increase. What an evil woman she was."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F_r57ytXwAAZY-C.jpg",
    "index": 12,
    "text": "So BBC hired a Palestinian journo in Gaza. His name is Amr Tabash.\n\nTabash supports terrorism. He makes joyful posts when Jews are murdered. \n\nHow can BBC use monsters like this? He celebrates the slaughter of Jews! His BBC article is still up!\n\nHave @bbcnews no shame at all? https://t.co/23H2HgHed3"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F9mgs3LXQAAimRC.png",
    "index": 2,
    "text": "Geneva Conventions, breached by Hamas having military position in, besides and under hospitals."
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-LeJz3WEAAE66t.jpg",
    "index": 4,
    "text": "In 2016, the US conducted an airstrike on a hospital in Mosul after ISIS terrorists inside used machine guns and RPGs to attack Iraqi ground forces. \n\nTerrorists, the whole world understood, must never be allowed to use hospitals to launch attacks or shield themselves. https://t.co/NfBKG8PXwl"
  },
  {
    "img_url": "https://media.cnn.com/api/v1/images/stellar/prod/231104154849-gaza-diamond-dnt.jpg?c=16x9&q=w_850,c_fill",
    "index": 5,
    "text": "It appears more people need to read this. \"Opinion: I’m an expert in urban warfare. Israel is upholding the laws of war\" @CNN @CNNOpinion  https://t.co/S5tfk6MNNA"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-lzAxYXUAAzPED.jpg",
    "index": 6,
    "text": "Hi, I’m a lawyer. Do want to know what is really meant by a “#proportionate response” under international law? Then read on - and feel free to ask questions!\n\nUnder International Humanitarian Law, #proportionality requires that any degree of damage (up to and including death) to #civilians not be “excessive” in relation to the “military advantage anticipated from a strike against a military target.”\n\nWe are going to break that down, so everyone understands what exactly that means.\n\nHowever, first, you should be aware that it is a misnomer that anytime #Palestinian civilians die after an #Israeli strike, it is automatically evidence of an Israeli war crime. This is completely false - the law does not work that way.\n\nSimply, and unfortunately, the international rules of law recognize that civilians are often killed during war; and, most of the time, those deaths are actually not indicative of a war crime.\n\nInstead, the legal test for “proportionality” requires that each individual strike be looked at with a particular balancing analysis.\n\nFirst, here is a hard and fast rule: the strike must be intended to target a military objective; it is, therefore, an unlawful war crime to strike with the intent of targeting civilians without any military objective whatsoever.\n\nNow, let’s get a little technical while still keeping it simple.\n\nUnder the First Additional Protocol to the Geneva Conventions of 1977 at both Article 51(5)(b) and Article 52(2), we know that when #Hamas uses its own population (or Israeli #hostages) as #humanshields - either by using them to shield themselves or to shield their weapons depots - Hamas has, under international law, turned civilians targets into military targets.\n\nThat means that when Hamas places weapons caches in and under schools, hospitals, mosques, etc., Hamas has made each of those places legitimate military targets.\n\nSo, it has been well-known for many years that Hamas purposefully placed its headquarters underground beneath the al-Shifa Hospital. In doing so, international law holds that the hospital is no longer just a civilian target, it is a legitimate military target.\n\nThat does not necessarily give the IDF carte blanche to attack hospitals, schools, mosques, etc.; however, it does mean that an IDF attack on a civilian target that has been made into a military target by Hamas’ use of human shields is not per se illegal under international law.\n\nInstead, such a strike (as is the case with any strike conducted by a military like the IDF), must be analyzed through a balancing test.\n\nOne part of this balancing test performed by Israel before each strike is to determine whether the human shields in question are being used voluntarily or involuntarily.\n\nIf the human shields are being used voluntarily - meaning the human shields are there protecting Hamas and its weapons of their own volition - then the target remains a completely legitimate military target.\n\nIf the human shields are being used involuntarily - meaning Hamas is forcing people to act as human shields to protect themselves and/or their weapons - then the IDF must go back to the balancing test to determine whether the anticipated military advantage of a successful strike would outweigh the reasonably anticipated loss of civilian life.\n\nImportantly, the IDF rules state that if it cannot determine whether a human shield is being used voluntarily or involuntarily, it must presume the civilian is being used against his or her own will and treat the civilians as an involuntary participant.\n\nAssuming that there is a military target & that there may be human shields that are there involuntarily, the next step in the proportionality analysis for each individual strike (remember, proportionality is determined on a strike-by-strike basis, and not as the accumulation of strikes over time) is to try to determine the likely amount of damage to civilian persons and/or property as a result of the strike.\n\nIn other words, under international law, Israel must be able to give a sort of “value” to the anticipated impact on civilians (including potential civilian deaths). Simply, a smaller number of anticipated civilian casualties may make the strike proportionate if there is a significant military advantage to be gained by conducting the strike.\n\nHowever, if Israel determines that the anticipated impact of a strike may cause many civilian casualties, it must make the difficult determination of whether the anticipated military advantage is so significant that it warrants carrying out the strike anyway.\n\nSo, if Hamas has a weapons depot underneath a house with two civilians inside, and that house has been used to fire 500 rockets at Israeli civilians, and it is reasonably expected that there are hundreds more rockets under that house, Israel can almost certainly carry out the strike within the confines of international law.\n\nIf that same house, however, had 10 families living inside, including many children, it could - and likely would - tip the scales of the proportionality balancing test toward Israel not being permitted to carry out the strike, even though the house has been used to attack Israeli civilians and can be expected to continue to be used to carry out attacks against Israeli civilians.\n\nNow, that balancing test can always change. If that same house is being used to fire long-range, precision-guided missiles at Israel’s major population centers in places like #TelAviv (effectively putting millions of Israeli civilians in danger), the balancing test may tip back in favor of Israel being legally permitted to carry out the strike.\n\nThis all suggests the third and final step in the proportionality balancing test: the #IDF must determine and place a “value” on the anticipated military advantage that would be gained if it were to carry out a particular strike.\n\nAn attack on Hamas leadership and/or its weapons manufacturers would be considered a high value target. An attack on a single Hamas member who has no special skill, would be a much lower value military target.\n\nSimilarly, an attack on a small cache of mortars would have less military value that an attack on a large cache of advanced rockets that can reach large Israeli civilian population centers.\n\nOnce the @IDF determines the anticipated “value” of the likely effect on civilian persons and property and the anticipated “value” of the likely military advantage to be gained if the strike is carried out, the balancing test can be performed, and a certain amount of judgment must go into the determination of whether that strike would or would not be “proportionate.”\n\nImportantly, this decision is so vital that the IDF does not simply permit a single solder on the ground with his or her hand on the proverbial (or actual) “trigger” to make that determination.\n\nIn fact, the decision of whether a strike is proportionate is not even left up to IDF officers. It’s not even left up to IDF Generals.\n\nInstead, before any IDF strike can take place, IDF Guidelines provide that the proportionality balancing test must be presented to and analyzed by IDF military lawyers who then determine whether the strike is legally permissible as “proportionate” under international law and the rules of war.\n\nAnd these IDF military lawyers are not mere patsies or people who simply “rubber stamp” what the IDF requests.\n\nIn fact, the IDF’s military lawyers work entirely independently of the IDF. They are outside of the chain of command and do not answer to anyone in the IDF, including a General (for example).\n\nPlus, every IDF military lawyer knows he or she may very well be held to account if he or she makes a wrong decision based on the evidence available at the time.\n\nFurthermore, sometimes the decisions to be made while balancing the likely military advantage against the likely civilian casualties can be so difficult that the legality of the strike is first brought to the Israeli Supreme Court for instant review.\n\nAnother important concept: the comparison of civilian body counts of #Israelis versus #Palestinians (to the extent those numbers can be trusted since they come directly from Hamas-only) is not relevant to a proportionality analysis. Each strike must be viewed individually to determine proportionality. It is not a test of the cumulative nature of the strikes.\n\nAlso, by simply comparing body counts, it does not factor in how many people killed were actually #HamasTerrorists, how many were Hamas collaborators there voluntarily, and it does not consider what military advantage was gained by Israel carrying out any individual strike.\n\nAs Israel is now in the process of seeking to secure the military advantage of preventing Hamas from having the capacity to carry out repeated attacks of the kind and nature seen on October 7th, Israel is permitted to act proportionately insofar as necessary to achieve that military objective (the elimination of Hamas and/or its ability to make war).\n\nOne more important fact people do not know, but that they should know: according to UN statistics of global conflict, the average civilian to combatant killed ratio is a rather appalling nine civilians killed for every one combatant killed.\n\nThat’s why civilian body counts in and of themselves are never indicative of a war crime. Each individual strike has to be analyzed, and unfortunately civilians always suffer disproportionately in wars.\n\nIn fact, while Israel is routinely criticized for any of its strikes that kill civilians, you may be surprised to know that Israel’s civilian to combatant ratio is routinely much lower than the nine to one average.\n\nIn the very last operation carried out by the IDF prior to October 7 (in Jenin), 0.6 civilians were killed for every one combatant killed.\n\nIn that conflict, not only were the IDF’s ratio numbers nowhere near the nine to one international average, but the IDF actually managed to kill more combatants than civilians - something that is extremely rare.\n\nIn truth, Israel is targeted by accusations of war crimes almost immediately by the media, by politicians, and by the UN General Assembly despite the fact that those accusations are near 100% of the time based neither in fact nor in law.\n\nSince a proportionality balancing test must be used to determine whether a single specific Israeli strike falls within the confines of international law, someone providing an analysis must have all of the facts Israel considered before carrying out that strike as to the anticipated impact on civilians and the anticipated military advantage. Obviously, anyone who is making a snap judgment critical of Israel could not possibly have that information.\n\nUnderstand then, that when you see talking heads accusing Israel of “war crimes” immediately after and/or during Israeli strikes, that is not an actual legal analysis under international law of what constitutes a war crime.\n\nMuch more likely, what you are witnessing is part of Hamas’ ongoing psychological and propaganda warfare campaign of demonizing and delegitimizing the State of Israel in the eyes of public opinion.\n\n#Hamas_is_ISIS #HamasisISIS #HamasISIS #HamasMonsters #October7massacre"
  },
  {
    "img_url": "https://pbs.twimg.com/media/F-1vRDAWoAAmGj3.jpg",
    "index": 8,
    "text": "Hi, lawyer here again. You’ve heard Israel has a right to \"self-defense,\" but you may have noticed politicians & media stars disagree on what Israel is permitted to do in #SelfDefense. Want to know how international law really defines the limits of “self-defense?” Then read on.\n\n“Self-Defense” Under International Law\n\nSelf-defense is the most basic legal right afforded to all sovereign nations.\n\nUnder both customary international law & Article 51 of the #UN Charter, all countries acknowledge one another’s “inherent right” to self-defense against armed attack.\n\nYou may hear some claim Israel’s self-defense is limited to what he or she claims is “#proportionate” to the #HamasMassacre of October 7-only. That is incorrect.\n\nIsrael’s right to self-defense under international law continues until it has eradicated the ongoing threat of further attacks by #Hamas.\n\nWhy? Well, the #October7massacre was only the latest & most deadly #TerroristAttack by Hamas against Israel.\n\nHamas’ Goals Stated in its Charter\n\nFor anyone paying attention, Hamas does not hide its intentions. Its raison d’être is expressly stated in its 1988 Charter, which includes the following (just a few examples):\n\n(1) Hamas is in a worldwide religious “struggle against the #Jews”;\n\n(2) Hamas intends to “raise the banner of #Allah over every inch of Palestine” (“from the Jordan River to the Mediterranean Sea”) where it plans an Islamic Caliphate; and\n\n(3) Hamas vows no #peace with Israel, claiming “Palestine is an #Islamic land.”\n\nHamas’ Early Attempts to Thwart Peace with Terror\n\nHamas has been carrying out terror attacks against Israeli civilians for ~35 years.\n\nTo help kill the 1993 & 1995 “Oslo Accords” in the cradle, Hamas carried out & celebrated multiple terror attacks, just a few of which include:\n\n(1) Oct 19, 1994: suicide bomber murdered 22 Israeli civilians & wounded 56 on a public bus in Tel Aviv;\n\n(2) Feb 25, 1996: suicide bomber murdered 26 Israeli civilians & wounded 80 on a public bus in Jerusalem; and\n\n(3) Feb 25-March 4, 1996: three Hamas suicide bombings in seven days murdered 65 Israeli civilians & wounded 164 (two on public busses in Jerusalem & one in Tel Aviv’s largest shopping mall).\n\nCamp David 2000 & the Second Intifada\n\nAt Camp David in 2000, U.S. #President Bill Clinton hosted #Israeli Prime Minister Ehud Barak & Palestinian Authority President Yasser Arafat to finalize a peace agreement.\n\nBarak accepted the \"Clinton Parameters\" & agreed to recognize a Palestinian state on 100% of the Gaza Strip & up to 97% of the #WestBank (with land swaps to make up for the remaining ~3%) with East #Jerusalem as its capital in return for “the end of belligerency and any further claims.”\n\nArafat rejected the offer.\n\nArafat made no counter offer.\n\nArafat, instead, ordered the Second #Intifada.\n\nArafat released dozens of Hamas & Islamic #Jihad terrorists from #Palestinian jails & made a strategic return to #terrorism.\n\nThe Second Intifada saw bloody, almost-daily terrorist attacks for ~five years, during which more than 1,000 Israeli civilians were murdered.\n\nIn fact, more than 200 terror attacks were carried out against Israeli civilians between May 2003-July 2004 alone.\n\nThe constant terror - especially in response to Israel’s offer of peace & a Palestinian state - left scars on Israeli society that remain to this day.\n\n2005 - Israel Withdrew from Gaza Entirely & Hamas Took Over\n\nIsrael believed it had no \"peace partner\" in the PA, so Prime Minister Ariel Sharon adopted a “disengagement plan” from #Gaza in 2005, which saw Israel forcibly remove 9,000 Israelis living in 21 Jewish settlements in Gaza and dismantle 38 synagogues, 42 daycare centers, 36 kindergartens, seven elementary schools, and three high schools at a total cost of ~$900 million. Israel even dug up all Jewish graves and moved them out of Gaza.\n\nThere was no #siege & no #blockade - Gaza was under the complete control of the PA.\n\nBut here is a general overview of the unfortunate two years post-disengagement:\n\nSept 12, 2005: not a single Jew - alive or dead - was left in Gaza; PA took control.\n\nSept 23, 2005: Hamas fired 40 rockets at Israeli civilians in Sderot.\n\nJan 25, 2006: PA Legislative elections resulted in a Hamas victory.\n\nMarch 29, 2006: Hamas formed PA government under arch-terrorist Ismail Haniyeh.\n\nJune 25, 2006: Hamas terrorists crossed from Gaza into Israel, murdered two, wounded two, & kidnapped Gilad Shalit.\n\nFeb 8, 2007: Hamas and Fatah (PA President Mahmoud #Abbas’ organization) agreed to share power; Hamas reiterated it would “never” recognize Israel.\n\nJune 10-14, 2007: Hamas murdered or exiled every Fatah member from Gaza in a bloody coup.\n\nOnce the #genocidal Hamas terror organization completed it takeover of Gaza, both Israel & #Egypt (which also shares a border with Gaza) placed a “blockade” on Gaza that attempted to restrict smuggling of weapons & terrorists.\n\nHamas Terror & Israeli Responses\n\nAfter Hamas fired more than 10,000 rockets & mortars at Israeli civilians, Israel launched Operation Cast Lead in 2008; but international pressure forced Israel to end the operation with a “stalemate” #ceasefire instead of destroying Hamas.\n\nIn 2012, after Hamas continued to rain thousands of rockets on Israeli civilians, Israel launched Operation Pillar of Defense; but international pressure forced Israel to end the operation with a ceasefire.\n\nIn 2014, Hamas was still firing thousands of rockets on Israeli civilians, and Israel launched Operation Protective Edge; again, international pressure forced Israel to end its operation with a ceasefire.\n\nIn 2021, Hamas fired six rockets on Jerusalem (an Israeli “red line”) and then fired hundreds of rockets aimed at Israeli civilian population centers, including #TelAviv. Israel launched Operation Guardian of the Walls; but, again, international pressure forced Israel to end its operation with a ceasefire.\n\nOct 7, 2023: ~3,000 Hamas terrorists & their collaborators infiltrated Israel & committed mass atrocities including mutilations, rapes, torture, & murder of Israeli men, women, children, the elderly, the infirm, & infants. More than 1,200 Israelis were murdered, ~8,000 were wounded, and ~240 were kidnapped.\n\nExtent of Israel’s Legal Right to Self-Defense\n\nIsrael’s legal right to self-defense permits it to do everything “necessary” to ensure Hamas can never attack Israeli civilians again.\n\nAt a minimum, this is because of: (1) the genocidal brutality of Oct 7; (2) Hamas’ history of genocidal warfare against Israel & Jews; and (3) Hamas’ express commitment to repeat massacres like Oct 7 “over and over.”\n\nThus, Israel’s right to “self-defense” extends beyond just stopping Hamas’ immediate attacks (it still fires rockets daily at Israel), it permits Israel to completely eradicate Hamas’ military capability.\n\nOne way to think of how/why it is “necessary” for Israel to destroy Hamas’ military capability in self-defense is to understand countries not only have the right to eliminate threats to their civilian population, but they also have the right to restore a sense of security.\n\nOn October 7, Hamas shattered Israel’s sense of security since Hamas showed it had the capability to defeat Israel’s defensive measures.\n\nIsrael had invested heavily in defensive-only military capabilities such as building the #IronDome system that intercepts the majority of rockets fired from Gaza & by constructing bomb shelters across the country.\n\nHowever, on October 7, Hamas got around Israel’s defenses & carried out a genocidal massacre.\n\nAs a result, Israel is legally justified under international law to take necessary action in self-defense by completely destroying Hamas’ ability to make war or commit atrocities again by doing things such as: (1) capturing or killing Hamas’ command & control; (2) destroying Hamas’ combat capabilities by taking out operatives, launch sites, & military equipment; and (3) taking steps to prevent Hamas from reconstituting & rearming.\n\nOne additional thing to keep in mind with regard to Israel’s legal right to self-defense is the possibility that Israel could extend this right to #Iran given its role as the main sponsor of Hamas in both weapons and terror training.\n\nWhether Israel thinks it is a good idea to strike Iran directly remains to be seen; however, it is clear that Israel would be legally justified in doing so in order to stop Iran from funding attacks against its civilians.\n\n#Education #Israel #Palestine"
  }
]